synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/usart.h
// SPI_MASTER mode
#define US_CR_SPI_MASTER_RSTRX_Pos  2            /**< \brief (US_CR_SPI_MASTER) Reset Receiver */
#define US_CR_SPI_MASTER_RSTRX      (0x1u << US_CR_SPI_MASTER_RSTRX_Pos)
#define   US_CR_SPI_MASTER_RSTRX_0_Val    0x0u   /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_RSTRX_1_Val    0x1u   /**< \brief (US_CR_SPI_MASTER) Resets the receiver */
#define US_CR_SPI_MASTER_RSTRX_0    (US_CR_SPI_MASTER_RSTRX_0_Val  << US_CR_SPI_MASTER_RSTRX_Pos)
#define US_CR_SPI_MASTER_RSTRX_1    (US_CR_SPI_MASTER_RSTRX_1_Val  << US_CR_SPI_MASTER_RSTRX_Pos)
#define US_CR_SPI_MASTER_RSTTX_Pos  3            /**< \brief (US_CR_SPI_MASTER) Reset Transmitter */
#define US_CR_SPI_MASTER_RSTTX      (0x1u << US_CR_SPI_MASTER_RSTTX_Pos)
#define   US_CR_SPI_MASTER_RSTTX_0_Val    0x0u   /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_RSTTX_1_Val    0x1u   /**< \brief (US_CR_SPI_MASTER) Resets the transmitter */
#define US_CR_SPI_MASTER_RSTTX_0    (US_CR_SPI_MASTER_RSTTX_0_Val  << US_CR_SPI_MASTER_RSTTX_Pos)
#define US_CR_SPI_MASTER_RSTTX_1    (US_CR_SPI_MASTER_RSTTX_1_Val  << US_CR_SPI_MASTER_RSTTX_Pos)
#define US_CR_SPI_MASTER_RXEN_Pos   4            /**< \brief (US_CR_SPI_MASTER) Receiver Enable */
#define US_CR_SPI_MASTER_RXEN       (0x1u << US_CR_SPI_MASTER_RXEN_Pos)
#define   US_CR_SPI_MASTER_RXEN_0_Val     0x0u   /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_RXEN_1_Val     0x1u   /**< \brief (US_CR_SPI_MASTER) Enables the receiver, if RXDIS is 0 */
#define US_CR_SPI_MASTER_RXEN_0     (US_CR_SPI_MASTER_RXEN_0_Val   << US_CR_SPI_MASTER_RXEN_Pos)
#define US_CR_SPI_MASTER_RXEN_1     (US_CR_SPI_MASTER_RXEN_1_Val   << US_CR_SPI_MASTER_RXEN_Pos)
#define US_CR_SPI_MASTER_RXDIS_Pos  5            /**< \brief (US_CR_SPI_MASTER) Receiver Disable */
#define US_CR_SPI_MASTER_RXDIS      (0x1u << US_CR_SPI_MASTER_RXDIS_Pos)
#define   US_CR_SPI_MASTER_RXDIS_0_Val    0x0u   /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_RXDIS_1_Val    0x1u   /**< \brief (US_CR_SPI_MASTER) Disables the receiver */
#define US_CR_SPI_MASTER_RXDIS_0    (US_CR_SPI_MASTER_RXDIS_0_Val  << US_CR_SPI_MASTER_RXDIS_Pos)
#define US_CR_SPI_MASTER_RXDIS_1    (US_CR_SPI_MASTER_RXDIS_1_Val  << US_CR_SPI_MASTER_RXDIS_Pos)
#define US_CR_SPI_MASTER_TXEN_Pos   6            /**< \brief (US_CR_SPI_MASTER) Transmitter Enable */
#define US_CR_SPI_MASTER_TXEN       (0x1u << US_CR_SPI_MASTER_TXEN_Pos)
#define   US_CR_SPI_MASTER_TXEN_0_Val     0x0u   /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_TXEN_1_Val     0x1u   /**< \brief (US_CR_SPI_MASTER) Enables the transmitter if TXDIS is 0 */
#define US_CR_SPI_MASTER_TXEN_0     (US_CR_SPI_MASTER_TXEN_0_Val   << US_CR_SPI_MASTER_TXEN_Pos)
#define US_CR_SPI_MASTER_TXEN_1     (US_CR_SPI_MASTER_TXEN_1_Val   << US_CR_SPI_MASTER_TXEN_Pos)
#define US_CR_SPI_MASTER_TXDIS_Pos  7            /**< \brief (US_CR_SPI_MASTER) Transmitter Disable */
#define US_CR_SPI_MASTER_TXDIS      (0x1u << US_CR_SPI_MASTER_TXDIS_Pos)
#define   US_CR_SPI_MASTER_TXDIS_0_Val    0x0u   /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_TXDIS_1_Val    0x1u   /**< \brief (US_CR_SPI_MASTER) Disables the transmitter */
#define US_CR_SPI_MASTER_TXDIS_0    (US_CR_SPI_MASTER_TXDIS_0_Val  << US_CR_SPI_MASTER_TXDIS_Pos)
#define US_CR_SPI_MASTER_TXDIS_1    (US_CR_SPI_MASTER_TXDIS_1_Val  << US_CR_SPI_MASTER_TXDIS_Pos)
#define US_CR_SPI_MASTER_RSTSTA_Pos 8            /**< \brief (US_CR_SPI_MASTER) Reset Status Bits */
#define US_CR_SPI_MASTER_RSTSTA     (0x1u << US_CR_SPI_MASTER_RSTSTA_Pos)
#define   US_CR_SPI_MASTER_RSTSTA_0_Val   0x0u   /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_RSTSTA_1_Val   0x1u   /**< \brief (US_CR_SPI_MASTER) Resets the status bits PARE, FRAME, OVRE and RXBRK in the CSR */
#define US_CR_SPI_MASTER_RSTSTA_0   (US_CR_SPI_MASTER_RSTSTA_0_Val << US_CR_SPI_MASTER_RSTSTA_Pos)
#define US_CR_SPI_MASTER_RSTSTA_1   (US_CR_SPI_MASTER_RSTSTA_1_Val << US_CR_SPI_MASTER_RSTSTA_Pos)
#define US_CR_SPI_MASTER_STTBRK_Pos 9            /**< \brief (US_CR_SPI_MASTER) Start Break */
#define US_CR_SPI_MASTER_STTBRK     (0x1u << US_CR_SPI_MASTER_STTBRK_Pos)
#define   US_CR_SPI_MASTER_STTBRK_0_Val   0x0u   /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_STTBRK_1_Val   0x1u   /**< \brief (US_CR_SPI_MASTER) Starts transmission of a break after the characters present in THR and the Transmit Shift Register have been transmitted. No effect if a break is already being transmitted */
#define US_CR_SPI_MASTER_STTBRK_0   (US_CR_SPI_MASTER_STTBRK_0_Val << US_CR_SPI_MASTER_STTBRK_Pos)
#define US_CR_SPI_MASTER_STTBRK_1   (US_CR_SPI_MASTER_STTBRK_1_Val << US_CR_SPI_MASTER_STTBRK_Pos)
#define US_CR_SPI_MASTER_STPBRK_Pos 10           /**< \brief (US_CR_SPI_MASTER) Stop Break */
#define US_CR_SPI_MASTER_STPBRK     (0x1u << US_CR_SPI_MASTER_STPBRK_Pos)
#define   US_CR_SPI_MASTER_STPBRK_0_Val   0x0u   /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_STPBRK_1_Val   0x1u   /**< \brief (US_CR_SPI_MASTER) Stops transmission of the break after a minimum of one character length and transmits a high level during 12-bit periods.No effect if no break is being transmitted */
#define US_CR_SPI_MASTER_STPBRK_0   (US_CR_SPI_MASTER_STPBRK_0_Val << US_CR_SPI_MASTER_STPBRK_Pos)
#define US_CR_SPI_MASTER_STPBRK_1   (US_CR_SPI_MASTER_STPBRK_1_Val << US_CR_SPI_MASTER_STPBRK_Pos)
#define US_CR_SPI_MASTER_STTTO_Pos  11           /**< \brief (US_CR_SPI_MASTER) Start Time-out */
#define US_CR_SPI_MASTER_STTTO      (0x1u << US_CR_SPI_MASTER_STTTO_Pos)
#define   US_CR_SPI_MASTER_STTTO_0_Val    0x0u   /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_STTTO_1_Val    0x1u   /**< \brief (US_CR_SPI_MASTER) Starts waiting for a character before clocking the time-out counter */
#define US_CR_SPI_MASTER_STTTO_0    (US_CR_SPI_MASTER_STTTO_0_Val  << US_CR_SPI_MASTER_STTTO_Pos)
#define US_CR_SPI_MASTER_STTTO_1    (US_CR_SPI_MASTER_STTTO_1_Val  << US_CR_SPI_MASTER_STTTO_Pos)
#define US_CR_SPI_MASTER_SENDA_Pos  12           /**< \brief (US_CR_SPI_MASTER) Send Address */
#define US_CR_SPI_MASTER_SENDA      (0x1u << US_CR_SPI_MASTER_SENDA_Pos)
#define   US_CR_SPI_MASTER_SENDA_0_Val    0x0u   /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_SENDA_1_Val    0x1u   /**< \brief (US_CR_SPI_MASTER) In Multi-drop Mode only, the next character written to the THR is sent with the address bit set */
#define US_CR_SPI_MASTER_SENDA_0    (US_CR_SPI_MASTER_SENDA_0_Val  << US_CR_SPI_MASTER_SENDA_Pos)
#define US_CR_SPI_MASTER_SENDA_1    (US_CR_SPI_MASTER_SENDA_1_Val  << US_CR_SPI_MASTER_SENDA_Pos)
#define US_CR_SPI_MASTER_RSTIT_Pos  13           /**< \brief (US_CR_SPI_MASTER) Reset Iterations */
#define US_CR_SPI_MASTER_RSTIT      (0x1u << US_CR_SPI_MASTER_RSTIT_Pos)
#define   US_CR_SPI_MASTER_RSTIT_0_Val    0x0u   /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_RSTIT_1_Val    0x1u   /**< \brief (US_CR_SPI_MASTER) Resets ITERATION in CSR. No effect if the ISO7816 is not enabled */
#define US_CR_SPI_MASTER_RSTIT_0    (US_CR_SPI_MASTER_RSTIT_0_Val  << US_CR_SPI_MASTER_RSTIT_Pos)
#define US_CR_SPI_MASTER_RSTIT_1    (US_CR_SPI_MASTER_RSTIT_1_Val  << US_CR_SPI_MASTER_RSTIT_Pos)
#define US_CR_SPI_MASTER_RSTNACK_Pos 14           /**< \brief (US_CR_SPI_MASTER) Reset Non Acknowledge */
#define US_CR_SPI_MASTER_RSTNACK    (0x1u << US_CR_SPI_MASTER_RSTNACK_Pos)
#define   US_CR_SPI_MASTER_RSTNACK_0_Val  0x0u   /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_RSTNACK_1_Val  0x1u   /**< \brief (US_CR_SPI_MASTER) Resets NACK in CSR */
#define US_CR_SPI_MASTER_RSTNACK_0  (US_CR_SPI_MASTER_RSTNACK_0_Val << US_CR_SPI_MASTER_RSTNACK_Pos)
#define US_CR_SPI_MASTER_RSTNACK_1  (US_CR_SPI_MASTER_RSTNACK_1_Val << US_CR_SPI_MASTER_RSTNACK_Pos)
#define US_CR_SPI_MASTER_RETTO_Pos  15           /**< \brief (US_CR_SPI_MASTER) Rearm Time-out */
#define US_CR_SPI_MASTER_RETTO      (0x1u << US_CR_SPI_MASTER_RETTO_Pos)
#define   US_CR_SPI_MASTER_RETTO_0_Val    0x0u   /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_RETTO_1_Val    0x1u   /**< \brief (US_CR_SPI_MASTER) Restart Time-out */
#define US_CR_SPI_MASTER_RETTO_0    (US_CR_SPI_MASTER_RETTO_0_Val  << US_CR_SPI_MASTER_RETTO_Pos)
#define US_CR_SPI_MASTER_RETTO_1    (US_CR_SPI_MASTER_RETTO_1_Val  << US_CR_SPI_MASTER_RETTO_Pos)
#define US_CR_SPI_MASTER_DTREN_Pos  16           /**< \brief (US_CR_SPI_MASTER) Data Terminal Ready Enable */
#define US_CR_SPI_MASTER_DTREN      (0x1u << US_CR_SPI_MASTER_DTREN_Pos)
#define   US_CR_SPI_MASTER_DTREN_0_Val    0x0u   /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_DTREN_1_Val    0x1u   /**< \brief (US_CR_SPI_MASTER) Drives the pin DTR at 0 */
#define US_CR_SPI_MASTER_DTREN_0    (US_CR_SPI_MASTER_DTREN_0_Val  << US_CR_SPI_MASTER_DTREN_Pos)
#define US_CR_SPI_MASTER_DTREN_1    (US_CR_SPI_MASTER_DTREN_1_Val  << US_CR_SPI_MASTER_DTREN_Pos)
#define US_CR_SPI_MASTER_DTRDIS_Pos 17           /**< \brief (US_CR_SPI_MASTER) Data Terminal Ready Disable */
#define US_CR_SPI_MASTER_DTRDIS     (0x1u << US_CR_SPI_MASTER_DTRDIS_Pos)
#define   US_CR_SPI_MASTER_DTRDIS_0_Val   0x0u   /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_DTRDIS_1_Val   0x1u   /**< \brief (US_CR_SPI_MASTER) Drives the pin DTR to 1 */
#define US_CR_SPI_MASTER_DTRDIS_0   (US_CR_SPI_MASTER_DTRDIS_0_Val << US_CR_SPI_MASTER_DTRDIS_Pos)
#define US_CR_SPI_MASTER_DTRDIS_1   (US_CR_SPI_MASTER_DTRDIS_1_Val << US_CR_SPI_MASTER_DTRDIS_Pos)
#define US_CR_SPI_MASTER_FCS_Pos    18           /**< \brief (US_CR_SPI_MASTER) Force SPI Chip Select */
#define US_CR_SPI_MASTER_FCS        (0x1u << US_CR_SPI_MASTER_FCS_Pos)
#define   US_CR_SPI_MASTER_FCS_0_Val      0x0u   /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_FCS_1_Val      0x1u   /**< \brief (US_CR_SPI_MASTER) Forces the Slave Select Line NSS (RTS pin) to 0, even if USART is no transmitting, in order to address SPI slave devices supporting the CSAAT Mode (Chip Select Active After Transfer) */
#define US_CR_SPI_MASTER_FCS_0      (US_CR_SPI_MASTER_FCS_0_Val    << US_CR_SPI_MASTER_FCS_Pos)
#define US_CR_SPI_MASTER_FCS_1      (US_CR_SPI_MASTER_FCS_1_Val    << US_CR_SPI_MASTER_FCS_Pos)
#define US_CR_SPI_MASTER_RCS_Pos    19           /**< \brief (US_CR_SPI_MASTER) Release SPI Chip Select */
#define US_CR_SPI_MASTER_RCS        (0x1u << US_CR_SPI_MASTER_RCS_Pos)
#define   US_CR_SPI_MASTER_RCS_0_Val      0x0u   /**< \brief (US_CR_SPI_MASTER) No effect */
#define   US_CR_SPI_MASTER_RCS_1_Val      0x1u   /**< \brief (US_CR_SPI_MASTER) Releases the Slave Select Line NSS (RTS pin) */
#define US_CR_SPI_MASTER_RCS_0      (US_CR_SPI_MASTER_RCS_0_Val    << US_CR_SPI_MASTER_RCS_Pos)
#define US_CR_SPI_MASTER_RCS_1      (US_CR_SPI_MASTER_RCS_1_Val    << US_CR_SPI_MASTER_RCS_Pos)
#define US_CR_SPI_MASTER_MASK       0x000FFFFCu  /**< \brief (US_CR_SPI_MASTER) MASK Register */

