synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/usart.h
// SPI mode
#define US_MR_SPI_MODE_Pos          0            /**< \brief (US_MR_SPI) Usart Mode */
#define US_MR_SPI_MODE_Msk          (0xFu << US_MR_SPI_MODE_Pos)
#define US_MR_SPI_MODE(value)       ((US_MR_SPI_MODE_Msk & ((value) << US_MR_SPI_MODE_Pos)))
#define   US_MR_SPI_MODE_NORMAL_Val       0x0u   /**< \brief (US_MR_SPI) Normal */
#define   US_MR_SPI_MODE_RS485_Val        0x1u   /**< \brief (US_MR_SPI) RS485 */
#define   US_MR_SPI_MODE_HARDWARE_Val     0x2u   /**< \brief (US_MR_SPI) Hardware Handshaking */
#define   US_MR_SPI_MODE_MODEM_Val        0x3u   /**< \brief (US_MR_SPI) Modem */
#define   US_MR_SPI_MODE_ISO7816_T0_Val   0x4u   /**< \brief (US_MR_SPI) IS07816 Protocol: T = 0 */
#define   US_MR_SPI_MODE_ISO7816_T1_Val   0x6u   /**< \brief (US_MR_SPI) IS07816 Protocol: T = 1 */
#define   US_MR_SPI_MODE_IRDA_Val         0x8u   /**< \brief (US_MR_SPI) IrDA */
#define   US_MR_SPI_MODE_LIN_MASTER_Val   0xAu   /**< \brief (US_MR_SPI) LIN Master */
#define   US_MR_SPI_MODE_LIN_SLAVE_Val    0xBu   /**< \brief (US_MR_SPI) LIN Slave */
#define   US_MR_SPI_MODE_SPI_MASTER_Val   0xEu   /**< \brief (US_MR_SPI) SPI Master */
#define   US_MR_SPI_MODE_SPI_SLAVE_Val    0xFu   /**< \brief (US_MR_SPI) SPI Slave */
#define US_MR_SPI_MODE_NORMAL       (US_MR_SPI_MODE_NORMAL_Val     << US_MR_SPI_MODE_Pos)
#define US_MR_SPI_MODE_RS485        (US_MR_SPI_MODE_RS485_Val      << US_MR_SPI_MODE_Pos)
#define US_MR_SPI_MODE_HARDWARE     (US_MR_SPI_MODE_HARDWARE_Val   << US_MR_SPI_MODE_Pos)
#define US_MR_SPI_MODE_MODEM        (US_MR_SPI_MODE_MODEM_Val      << US_MR_SPI_MODE_Pos)
#define US_MR_SPI_MODE_ISO7816_T0   (US_MR_SPI_MODE_ISO7816_T0_Val << US_MR_SPI_MODE_Pos)
#define US_MR_SPI_MODE_ISO7816_T1   (US_MR_SPI_MODE_ISO7816_T1_Val << US_MR_SPI_MODE_Pos)
#define US_MR_SPI_MODE_IRDA         (US_MR_SPI_MODE_IRDA_Val       << US_MR_SPI_MODE_Pos)
#define US_MR_SPI_MODE_LIN_MASTER   (US_MR_SPI_MODE_LIN_MASTER_Val << US_MR_SPI_MODE_Pos)
#define US_MR_SPI_MODE_LIN_SLAVE    (US_MR_SPI_MODE_LIN_SLAVE_Val  << US_MR_SPI_MODE_Pos)
#define US_MR_SPI_MODE_SPI_MASTER   (US_MR_SPI_MODE_SPI_MASTER_Val << US_MR_SPI_MODE_Pos)
#define US_MR_SPI_MODE_SPI_SLAVE    (US_MR_SPI_MODE_SPI_SLAVE_Val  << US_MR_SPI_MODE_Pos)
#define US_MR_SPI_USCLKS_Pos        4            /**< \brief (US_MR_SPI) Clock Selection */
#define US_MR_SPI_USCLKS_Msk        (0x3u << US_MR_SPI_USCLKS_Pos)
#define US_MR_SPI_USCLKS(value)     ((US_MR_SPI_USCLKS_Msk & ((value) << US_MR_SPI_USCLKS_Pos)))
#define   US_MR_SPI_USCLKS_MCK_Val        0x0u   /**< \brief (US_MR_SPI) MCK */
#define   US_MR_SPI_USCLKS_MCK_DIV_Val    0x1u   /**< \brief (US_MR_SPI) MCK / DIV */
#define   US_MR_SPI_USCLKS_2_Val          0x2u   /**< \brief (US_MR_SPI) Reserved */
#define   US_MR_SPI_USCLKS_SCK_Val        0x3u   /**< \brief (US_MR_SPI) SCK */
#define US_MR_SPI_USCLKS_MCK        (US_MR_SPI_USCLKS_MCK_Val      << US_MR_SPI_USCLKS_Pos)
#define US_MR_SPI_USCLKS_MCK_DIV    (US_MR_SPI_USCLKS_MCK_DIV_Val  << US_MR_SPI_USCLKS_Pos)
#define US_MR_SPI_USCLKS_2          (US_MR_SPI_USCLKS_2_Val        << US_MR_SPI_USCLKS_Pos)
#define US_MR_SPI_USCLKS_SCK        (US_MR_SPI_USCLKS_SCK_Val      << US_MR_SPI_USCLKS_Pos)
#define US_MR_SPI_CHRL_Pos          6            /**< \brief (US_MR_SPI) Character Length. */
#define US_MR_SPI_CHRL_Msk          (0x3u << US_MR_SPI_CHRL_Pos)
#define US_MR_SPI_CHRL(value)       ((US_MR_SPI_CHRL_Msk & ((value) << US_MR_SPI_CHRL_Pos)))
#define   US_MR_SPI_CHRL_5_Val            0x0u   /**< \brief (US_MR_SPI) 5 bits */
#define   US_MR_SPI_CHRL_6_Val            0x1u   /**< \brief (US_MR_SPI) 6 bits */
#define   US_MR_SPI_CHRL_7_Val            0x2u   /**< \brief (US_MR_SPI) 7 bits */
#define   US_MR_SPI_CHRL_8_Val            0x3u   /**< \brief (US_MR_SPI) 8 bits */
#define US_MR_SPI_CHRL_5            (US_MR_SPI_CHRL_5_Val          << US_MR_SPI_CHRL_Pos)
#define US_MR_SPI_CHRL_6            (US_MR_SPI_CHRL_6_Val          << US_MR_SPI_CHRL_Pos)
#define US_MR_SPI_CHRL_7            (US_MR_SPI_CHRL_7_Val          << US_MR_SPI_CHRL_Pos)
#define US_MR_SPI_CHRL_8            (US_MR_SPI_CHRL_8_Val          << US_MR_SPI_CHRL_Pos)
#define US_MR_SPI_CPHA_Pos          8            /**< \brief (US_MR_SPI) SPI CLock Phase */
#define US_MR_SPI_CPHA              (0x1u << US_MR_SPI_CPHA_Pos)
#define   US_MR_SPI_CPHA_0_Val            0x0u   /**< \brief (US_MR_SPI) Data is changed on the leading edge of SPCK and captured on the following edge of SPCK */
#define   US_MR_SPI_CPHA_1_Val            0x1u   /**< \brief (US_MR_SPI) Data is captured on the leading edge of SPCK and changed on the following edge of SPCK */
#define US_MR_SPI_CPHA_0            (US_MR_SPI_CPHA_0_Val          << US_MR_SPI_CPHA_Pos)
#define US_MR_SPI_CPHA_1            (US_MR_SPI_CPHA_1_Val          << US_MR_SPI_CPHA_Pos)
#define US_MR_SPI_PAR_Pos           9            /**< \brief (US_MR_SPI) Parity Type */
#define US_MR_SPI_PAR_Msk           (0x7u << US_MR_SPI_PAR_Pos)
#define US_MR_SPI_PAR(value)        ((US_MR_SPI_PAR_Msk & ((value) << US_MR_SPI_PAR_Pos)))
#define   US_MR_SPI_PAR_EVEN_Val          0x0u   /**< \brief (US_MR_SPI) Even parity */
#define   US_MR_SPI_PAR_ODD_Val           0x1u   /**< \brief (US_MR_SPI) Odd parity */
#define   US_MR_SPI_PAR_SPACE_Val         0x2u   /**< \brief (US_MR_SPI) Parity forced to 0 (Space) */
#define   US_MR_SPI_PAR_MARK_Val          0x3u   /**< \brief (US_MR_SPI) Parity forced to 1 (Mark) */
#define   US_MR_SPI_PAR_NONE_Val          0x4u   /**< \brief (US_MR_SPI) No Parity */
#define   US_MR_SPI_PAR_5_Val             0x5u   /**< \brief (US_MR_SPI) No Parity */
#define   US_MR_SPI_PAR_MULTI_Val         0x6u   /**< \brief (US_MR_SPI) Multi-drop mode */
#define   US_MR_SPI_PAR_7_Val             0x7u   /**< \brief (US_MR_SPI) Multi-drop mode */
#define US_MR_SPI_PAR_EVEN          (US_MR_SPI_PAR_EVEN_Val        << US_MR_SPI_PAR_Pos)
#define US_MR_SPI_PAR_ODD           (US_MR_SPI_PAR_ODD_Val         << US_MR_SPI_PAR_Pos)
#define US_MR_SPI_PAR_SPACE         (US_MR_SPI_PAR_SPACE_Val       << US_MR_SPI_PAR_Pos)
#define US_MR_SPI_PAR_MARK          (US_MR_SPI_PAR_MARK_Val        << US_MR_SPI_PAR_Pos)
#define US_MR_SPI_PAR_NONE          (US_MR_SPI_PAR_NONE_Val        << US_MR_SPI_PAR_Pos)
#define US_MR_SPI_PAR_5             (US_MR_SPI_PAR_5_Val           << US_MR_SPI_PAR_Pos)
#define US_MR_SPI_PAR_MULTI         (US_MR_SPI_PAR_MULTI_Val       << US_MR_SPI_PAR_Pos)
#define US_MR_SPI_PAR_7             (US_MR_SPI_PAR_7_Val           << US_MR_SPI_PAR_Pos)
#define US_MR_SPI_NBSTOP_Pos        12           /**< \brief (US_MR_SPI) Number of Stop Bits */
#define US_MR_SPI_NBSTOP_Msk        (0x3u << US_MR_SPI_NBSTOP_Pos)
#define US_MR_SPI_NBSTOP(value)     ((US_MR_SPI_NBSTOP_Msk & ((value) << US_MR_SPI_NBSTOP_Pos)))
#define   US_MR_SPI_NBSTOP_1_Val          0x0u   /**< \brief (US_MR_SPI) 1 stop bit */
#define   US_MR_SPI_NBSTOP_1_5_Val        0x1u   /**< \brief (US_MR_SPI) 1.5 stop bits (Only valid if SYNC=0) */
#define   US_MR_SPI_NBSTOP_2_Val          0x2u   /**< \brief (US_MR_SPI) 2 stop bits */
#define   US_MR_SPI_NBSTOP_3_Val          0x3u   /**< \brief (US_MR_SPI) Reserved */
#define US_MR_SPI_NBSTOP_1          (US_MR_SPI_NBSTOP_1_Val        << US_MR_SPI_NBSTOP_Pos)
#define US_MR_SPI_NBSTOP_1_5        (US_MR_SPI_NBSTOP_1_5_Val      << US_MR_SPI_NBSTOP_Pos)
#define US_MR_SPI_NBSTOP_2          (US_MR_SPI_NBSTOP_2_Val        << US_MR_SPI_NBSTOP_Pos)
#define US_MR_SPI_NBSTOP_3          (US_MR_SPI_NBSTOP_3_Val        << US_MR_SPI_NBSTOP_Pos)
#define US_MR_SPI_CHMODE_Pos        14           /**< \brief (US_MR_SPI) Channel Mode */
#define US_MR_SPI_CHMODE_Msk        (0x3u << US_MR_SPI_CHMODE_Pos)
#define US_MR_SPI_CHMODE(value)     ((US_MR_SPI_CHMODE_Msk & ((value) << US_MR_SPI_CHMODE_Pos)))
#define   US_MR_SPI_CHMODE_NORMAL_Val     0x0u   /**< \brief (US_MR_SPI) Normal Mode */
#define   US_MR_SPI_CHMODE_ECHO_Val       0x1u   /**< \brief (US_MR_SPI) Automatic Echo. Receiver input is connected to the TXD pin */
#define   US_MR_SPI_CHMODE_LOCAL_LOOP_Val 0x2u   /**< \brief (US_MR_SPI) Local Loopback. Transmitter output is connected to the Receiver Input */
#define   US_MR_SPI_CHMODE_REMOTE_LOOP_Val 0x3u   /**< \brief (US_MR_SPI) Remote Loopback. RXD pin is internally connected to the TXD pin */
#define US_MR_SPI_CHMODE_NORMAL     (US_MR_SPI_CHMODE_NORMAL_Val   << US_MR_SPI_CHMODE_Pos)
#define US_MR_SPI_CHMODE_ECHO       (US_MR_SPI_CHMODE_ECHO_Val     << US_MR_SPI_CHMODE_Pos)
#define US_MR_SPI_CHMODE_LOCAL_LOOP (US_MR_SPI_CHMODE_LOCAL_LOOP_Val << US_MR_SPI_CHMODE_Pos)
#define US_MR_SPI_CHMODE_REMOTE_LOOP (US_MR_SPI_CHMODE_REMOTE_LOOP_Val << US_MR_SPI_CHMODE_Pos)
#define US_MR_SPI_CPOL_Pos          16           /**< \brief (US_MR_SPI) SPI Clock Polarity */
#define US_MR_SPI_CPOL              (0x1u << US_MR_SPI_CPOL_Pos)
#define   US_MR_SPI_CPOL_ZERO_Val         0x0u   /**< \brief (US_MR_SPI) The inactive state value of SPCK is logic level zero */
#define   US_MR_SPI_CPOL_ONE_Val          0x1u   /**< \brief (US_MR_SPI) The inactive state value of SPCK is logic level one */
#define US_MR_SPI_CPOL_ZERO         (US_MR_SPI_CPOL_ZERO_Val       << US_MR_SPI_CPOL_Pos)
#define US_MR_SPI_CPOL_ONE          (US_MR_SPI_CPOL_ONE_Val        << US_MR_SPI_CPOL_Pos)
#define US_MR_SPI_MODE9_Pos         17           /**< \brief (US_MR_SPI) 9-bit Character Length */
#define US_MR_SPI_MODE9             (0x1u << US_MR_SPI_MODE9_Pos)
#define   US_MR_SPI_MODE9_0_Val           0x0u   /**< \brief (US_MR_SPI) CHRL defines character length */
#define   US_MR_SPI_MODE9_1_Val           0x1u   /**< \brief (US_MR_SPI) 9-bit character length */
#define US_MR_SPI_MODE9_0           (US_MR_SPI_MODE9_0_Val         << US_MR_SPI_MODE9_Pos)
#define US_MR_SPI_MODE9_1           (US_MR_SPI_MODE9_1_Val         << US_MR_SPI_MODE9_Pos)
#define US_MR_SPI_CLKO_Pos          18           /**< \brief (US_MR_SPI) Clock Output Select */
#define US_MR_SPI_CLKO              (0x1u << US_MR_SPI_CLKO_Pos)
#define   US_MR_SPI_CLKO_0_Val            0x0u   /**< \brief (US_MR_SPI) The USART does not drive the SCK pin */
#define   US_MR_SPI_CLKO_1_Val            0x1u   /**< \brief (US_MR_SPI) The USART drives the SCK pin if USCLKS does not select the external clock SCK */
#define US_MR_SPI_CLKO_0            (US_MR_SPI_CLKO_0_Val          << US_MR_SPI_CLKO_Pos)
#define US_MR_SPI_CLKO_1            (US_MR_SPI_CLKO_1_Val          << US_MR_SPI_CLKO_Pos)
#define US_MR_SPI_OVER_Pos          19           /**< \brief (US_MR_SPI) Oversampling Mode */
#define US_MR_SPI_OVER              (0x1u << US_MR_SPI_OVER_Pos)
#define   US_MR_SPI_OVER_X16_Val          0x0u   /**< \brief (US_MR_SPI) 16x Oversampling */
#define   US_MR_SPI_OVER_X8_Val           0x1u   /**< \brief (US_MR_SPI) 8x Oversampling */
#define US_MR_SPI_OVER_X16          (US_MR_SPI_OVER_X16_Val        << US_MR_SPI_OVER_Pos)
#define US_MR_SPI_OVER_X8           (US_MR_SPI_OVER_X8_Val         << US_MR_SPI_OVER_Pos)
#define US_MR_SPI_INACK_Pos         20           /**< \brief (US_MR_SPI) Inhibit Non Acknowledge */
#define US_MR_SPI_INACK             (0x1u << US_MR_SPI_INACK_Pos)
#define   US_MR_SPI_INACK_0_Val           0x0u   /**< \brief (US_MR_SPI) The NACK is generated */
#define   US_MR_SPI_INACK_1_Val           0x1u   /**< \brief (US_MR_SPI) The NACK is not generated */
#define US_MR_SPI_INACK_0           (US_MR_SPI_INACK_0_Val         << US_MR_SPI_INACK_Pos)
#define US_MR_SPI_INACK_1           (US_MR_SPI_INACK_1_Val         << US_MR_SPI_INACK_Pos)
#define US_MR_SPI_DSNACK_Pos        21           /**< \brief (US_MR_SPI) Disable Successive NACK */
#define US_MR_SPI_DSNACK            (0x1u << US_MR_SPI_DSNACK_Pos)
#define   US_MR_SPI_DSNACK_0_Val          0x0u   /**< \brief (US_MR_SPI) NACK is sent on the ISO line as soon as a parity error occurs in the received character (unless INACK is set) */
#define   US_MR_SPI_DSNACK_1_Val          0x1u   /**< \brief (US_MR_SPI) Successive parity errors are counted up to the value specified in the MAX_ITERATION field. These parity errors generatea NACK on the ISO line. As soon as this value is reached, no additional NACK is sent on the ISO line. The flag ITERATION is asserted */
#define US_MR_SPI_DSNACK_0          (US_MR_SPI_DSNACK_0_Val        << US_MR_SPI_DSNACK_Pos)
#define US_MR_SPI_DSNACK_1          (US_MR_SPI_DSNACK_1_Val        << US_MR_SPI_DSNACK_Pos)
#define US_MR_SPI_INVDATA_Pos       23           /**< \brief (US_MR_SPI) Inverted data */
#define US_MR_SPI_INVDATA           (0x1u << US_MR_SPI_INVDATA_Pos)
#define US_MR_SPI_MAX_ITERATION_Pos 24           /**< \brief (US_MR_SPI) Max interation */
#define US_MR_SPI_MAX_ITERATION_Msk (0x7u << US_MR_SPI_MAX_ITERATION_Pos)
#define US_MR_SPI_MAX_ITERATION(value) ((US_MR_SPI_MAX_ITERATION_Msk & ((value) << US_MR_SPI_MAX_ITERATION_Pos)))
#define US_MR_SPI_FILTER_Pos        28           /**< \brief (US_MR_SPI) Infrared Receive Line Filter */
#define US_MR_SPI_FILTER            (0x1u << US_MR_SPI_FILTER_Pos)
#define   US_MR_SPI_FILTER_0_Val          0x0u   /**< \brief (US_MR_SPI) The USART does not filter the receive line */
#define   US_MR_SPI_FILTER_1_Val          0x1u   /**< \brief (US_MR_SPI) The USART filters the receive line using a three-sample filter (1/16-bit clock) (2 over 3 majority) */
#define US_MR_SPI_FILTER_0          (US_MR_SPI_FILTER_0_Val        << US_MR_SPI_FILTER_Pos)
#define US_MR_SPI_FILTER_1          (US_MR_SPI_FILTER_1_Val        << US_MR_SPI_FILTER_Pos)
#define US_MR_SPI_MASK              0x17BFFFFFu  /**< \brief (US_MR_SPI) MASK Register */

