synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/usart.h
// USART mode
#define US_MR_USART_MODE_Pos        0            /**< \brief (US_MR_USART) Usart Mode */
#define US_MR_USART_MODE_Msk        (0xFu << US_MR_USART_MODE_Pos)
#define US_MR_USART_MODE(value)     ((US_MR_USART_MODE_Msk & ((value) << US_MR_USART_MODE_Pos)))
#define   US_MR_USART_MODE_NORMAL_Val     0x0u   /**< \brief (US_MR_USART) Normal */
#define   US_MR_USART_MODE_RS485_Val      0x1u   /**< \brief (US_MR_USART) RS485 */
#define   US_MR_USART_MODE_HARDWARE_Val   0x2u   /**< \brief (US_MR_USART) Hardware Handshaking */
#define   US_MR_USART_MODE_MODEM_Val      0x3u   /**< \brief (US_MR_USART) Modem */
#define   US_MR_USART_MODE_ISO7816_T0_Val 0x4u   /**< \brief (US_MR_USART) IS07816 Protocol: T = 0 */
#define   US_MR_USART_MODE_ISO7816_T1_Val 0x6u   /**< \brief (US_MR_USART) IS07816 Protocol: T = 1 */
#define   US_MR_USART_MODE_IRDA_Val       0x8u   /**< \brief (US_MR_USART) IrDA */
#define   US_MR_USART_MODE_LIN_MASTER_Val 0xAu   /**< \brief (US_MR_USART) LIN Master */
#define   US_MR_USART_MODE_LIN_SLAVE_Val  0xBu   /**< \brief (US_MR_USART) LIN Slave */
#define   US_MR_USART_MODE_SPI_MASTER_Val 0xEu   /**< \brief (US_MR_USART) SPI Master */
#define   US_MR_USART_MODE_SPI_SLAVE_Val  0xFu   /**< \brief (US_MR_USART) SPI Slave */
#define US_MR_USART_MODE_NORMAL     (US_MR_USART_MODE_NORMAL_Val   << US_MR_USART_MODE_Pos)
#define US_MR_USART_MODE_RS485      (US_MR_USART_MODE_RS485_Val    << US_MR_USART_MODE_Pos)
#define US_MR_USART_MODE_HARDWARE   (US_MR_USART_MODE_HARDWARE_Val << US_MR_USART_MODE_Pos)
#define US_MR_USART_MODE_MODEM      (US_MR_USART_MODE_MODEM_Val    << US_MR_USART_MODE_Pos)
#define US_MR_USART_MODE_ISO7816_T0 (US_MR_USART_MODE_ISO7816_T0_Val << US_MR_USART_MODE_Pos)
#define US_MR_USART_MODE_ISO7816_T1 (US_MR_USART_MODE_ISO7816_T1_Val << US_MR_USART_MODE_Pos)
#define US_MR_USART_MODE_IRDA       (US_MR_USART_MODE_IRDA_Val     << US_MR_USART_MODE_Pos)
#define US_MR_USART_MODE_LIN_MASTER (US_MR_USART_MODE_LIN_MASTER_Val << US_MR_USART_MODE_Pos)
#define US_MR_USART_MODE_LIN_SLAVE  (US_MR_USART_MODE_LIN_SLAVE_Val << US_MR_USART_MODE_Pos)
#define US_MR_USART_MODE_SPI_MASTER (US_MR_USART_MODE_SPI_MASTER_Val << US_MR_USART_MODE_Pos)
#define US_MR_USART_MODE_SPI_SLAVE  (US_MR_USART_MODE_SPI_SLAVE_Val << US_MR_USART_MODE_Pos)
#define US_MR_USART_USCLKS_Pos      4            /**< \brief (US_MR_USART) Clock Selection */
#define US_MR_USART_USCLKS_Msk      (0x3u << US_MR_USART_USCLKS_Pos)
#define US_MR_USART_USCLKS(value)   ((US_MR_USART_USCLKS_Msk & ((value) << US_MR_USART_USCLKS_Pos)))
#define   US_MR_USART_USCLKS_MCK_Val      0x0u   /**< \brief (US_MR_USART) MCK */
#define   US_MR_USART_USCLKS_MCK_DIV_Val  0x1u   /**< \brief (US_MR_USART) MCK / DIV */
#define   US_MR_USART_USCLKS_2_Val        0x2u   /**< \brief (US_MR_USART) Reserved */
#define   US_MR_USART_USCLKS_SCK_Val      0x3u   /**< \brief (US_MR_USART) SCK */
#define US_MR_USART_USCLKS_MCK      (US_MR_USART_USCLKS_MCK_Val    << US_MR_USART_USCLKS_Pos)
#define US_MR_USART_USCLKS_MCK_DIV  (US_MR_USART_USCLKS_MCK_DIV_Val << US_MR_USART_USCLKS_Pos)
#define US_MR_USART_USCLKS_2        (US_MR_USART_USCLKS_2_Val      << US_MR_USART_USCLKS_Pos)
#define US_MR_USART_USCLKS_SCK      (US_MR_USART_USCLKS_SCK_Val    << US_MR_USART_USCLKS_Pos)
#define US_MR_USART_CHRL_Pos        6            /**< \brief (US_MR_USART) Character Length. */
#define US_MR_USART_CHRL_Msk        (0x3u << US_MR_USART_CHRL_Pos)
#define US_MR_USART_CHRL(value)     ((US_MR_USART_CHRL_Msk & ((value) << US_MR_USART_CHRL_Pos)))
#define   US_MR_USART_CHRL_5_Val          0x0u   /**< \brief (US_MR_USART) 5 bits */
#define   US_MR_USART_CHRL_6_Val          0x1u   /**< \brief (US_MR_USART) 6 bits */
#define   US_MR_USART_CHRL_7_Val          0x2u   /**< \brief (US_MR_USART) 7 bits */
#define   US_MR_USART_CHRL_8_Val          0x3u   /**< \brief (US_MR_USART) 8 bits */
#define US_MR_USART_CHRL_5          (US_MR_USART_CHRL_5_Val        << US_MR_USART_CHRL_Pos)
#define US_MR_USART_CHRL_6          (US_MR_USART_CHRL_6_Val        << US_MR_USART_CHRL_Pos)
#define US_MR_USART_CHRL_7          (US_MR_USART_CHRL_7_Val        << US_MR_USART_CHRL_Pos)
#define US_MR_USART_CHRL_8          (US_MR_USART_CHRL_8_Val        << US_MR_USART_CHRL_Pos)
#define US_MR_USART_SYNC_Pos        8            /**< \brief (US_MR_USART) Synchronous Mode Select */
#define US_MR_USART_SYNC            (0x1u << US_MR_USART_SYNC_Pos)
#define   US_MR_USART_SYNC_0_Val          0x0u   /**< \brief (US_MR_USART) USART operates in Synchronous Mode */
#define   US_MR_USART_SYNC_1_Val          0x1u   /**< \brief (US_MR_USART) USART operates in Asynchronous Mode */
#define US_MR_USART_SYNC_0          (US_MR_USART_SYNC_0_Val        << US_MR_USART_SYNC_Pos)
#define US_MR_USART_SYNC_1          (US_MR_USART_SYNC_1_Val        << US_MR_USART_SYNC_Pos)
#define US_MR_USART_PAR_Pos         9            /**< \brief (US_MR_USART) Parity Type */
#define US_MR_USART_PAR_Msk         (0x7u << US_MR_USART_PAR_Pos)
#define US_MR_USART_PAR(value)      ((US_MR_USART_PAR_Msk & ((value) << US_MR_USART_PAR_Pos)))
#define   US_MR_USART_PAR_EVEN_Val        0x0u   /**< \brief (US_MR_USART) Even parity */
#define   US_MR_USART_PAR_ODD_Val         0x1u   /**< \brief (US_MR_USART) Odd parity */
#define   US_MR_USART_PAR_SPACE_Val       0x2u   /**< \brief (US_MR_USART) Parity forced to 0 (Space) */
#define   US_MR_USART_PAR_MARK_Val        0x3u   /**< \brief (US_MR_USART) Parity forced to 1 (Mark) */
#define   US_MR_USART_PAR_NONE_Val        0x4u   /**< \brief (US_MR_USART) No Parity */
#define   US_MR_USART_PAR_5_Val           0x5u   /**< \brief (US_MR_USART) No Parity */
#define   US_MR_USART_PAR_MULTI_Val       0x6u   /**< \brief (US_MR_USART) Multi-drop mode */
#define   US_MR_USART_PAR_7_Val           0x7u   /**< \brief (US_MR_USART) Multi-drop mode */
#define US_MR_USART_PAR_EVEN        (US_MR_USART_PAR_EVEN_Val      << US_MR_USART_PAR_Pos)
#define US_MR_USART_PAR_ODD         (US_MR_USART_PAR_ODD_Val       << US_MR_USART_PAR_Pos)
#define US_MR_USART_PAR_SPACE       (US_MR_USART_PAR_SPACE_Val     << US_MR_USART_PAR_Pos)
#define US_MR_USART_PAR_MARK        (US_MR_USART_PAR_MARK_Val      << US_MR_USART_PAR_Pos)
#define US_MR_USART_PAR_NONE        (US_MR_USART_PAR_NONE_Val      << US_MR_USART_PAR_Pos)
#define US_MR_USART_PAR_5           (US_MR_USART_PAR_5_Val         << US_MR_USART_PAR_Pos)
#define US_MR_USART_PAR_MULTI       (US_MR_USART_PAR_MULTI_Val     << US_MR_USART_PAR_Pos)
#define US_MR_USART_PAR_7           (US_MR_USART_PAR_7_Val         << US_MR_USART_PAR_Pos)
#define US_MR_USART_NBSTOP_Pos      12           /**< \brief (US_MR_USART) Number of Stop Bits */
#define US_MR_USART_NBSTOP_Msk      (0x3u << US_MR_USART_NBSTOP_Pos)
#define US_MR_USART_NBSTOP(value)   ((US_MR_USART_NBSTOP_Msk & ((value) << US_MR_USART_NBSTOP_Pos)))
#define   US_MR_USART_NBSTOP_1_Val        0x0u   /**< \brief (US_MR_USART) 1 stop bit */
#define   US_MR_USART_NBSTOP_1_5_Val      0x1u   /**< \brief (US_MR_USART) 1.5 stop bits (Only valid if SYNC=0) */
#define   US_MR_USART_NBSTOP_2_Val        0x2u   /**< \brief (US_MR_USART) 2 stop bits */
#define   US_MR_USART_NBSTOP_3_Val        0x3u   /**< \brief (US_MR_USART) Reserved */
#define US_MR_USART_NBSTOP_1        (US_MR_USART_NBSTOP_1_Val      << US_MR_USART_NBSTOP_Pos)
#define US_MR_USART_NBSTOP_1_5      (US_MR_USART_NBSTOP_1_5_Val    << US_MR_USART_NBSTOP_Pos)
#define US_MR_USART_NBSTOP_2        (US_MR_USART_NBSTOP_2_Val      << US_MR_USART_NBSTOP_Pos)
#define US_MR_USART_NBSTOP_3        (US_MR_USART_NBSTOP_3_Val      << US_MR_USART_NBSTOP_Pos)
#define US_MR_USART_CHMODE_Pos      14           /**< \brief (US_MR_USART) Channel Mode */
#define US_MR_USART_CHMODE_Msk      (0x3u << US_MR_USART_CHMODE_Pos)
#define US_MR_USART_CHMODE(value)   ((US_MR_USART_CHMODE_Msk & ((value) << US_MR_USART_CHMODE_Pos)))
#define   US_MR_USART_CHMODE_NORMAL_Val   0x0u   /**< \brief (US_MR_USART) Normal Mode */
#define   US_MR_USART_CHMODE_ECHO_Val     0x1u   /**< \brief (US_MR_USART) Automatic Echo. Receiver input is connected to the TXD pin */
#define   US_MR_USART_CHMODE_LOCAL_LOOP_Val 0x2u   /**< \brief (US_MR_USART) Local Loopback. Transmitter output is connected to the Receiver Input */
#define   US_MR_USART_CHMODE_REMOTE_LOOP_Val 0x3u   /**< \brief (US_MR_USART) Remote Loopback. RXD pin is internally connected to the TXD pin */
#define US_MR_USART_CHMODE_NORMAL   (US_MR_USART_CHMODE_NORMAL_Val << US_MR_USART_CHMODE_Pos)
#define US_MR_USART_CHMODE_ECHO     (US_MR_USART_CHMODE_ECHO_Val   << US_MR_USART_CHMODE_Pos)
#define US_MR_USART_CHMODE_LOCAL_LOOP (US_MR_USART_CHMODE_LOCAL_LOOP_Val << US_MR_USART_CHMODE_Pos)
#define US_MR_USART_CHMODE_REMOTE_LOOP (US_MR_USART_CHMODE_REMOTE_LOOP_Val << US_MR_USART_CHMODE_Pos)
#define US_MR_USART_MSBF_Pos        16           /**< \brief (US_MR_USART) Bit Order */
#define US_MR_USART_MSBF            (0x1u << US_MR_USART_MSBF_Pos)
#define   US_MR_USART_MSBF_LSBF_Val       0x0u   /**< \brief (US_MR_USART) Least Significant Bit first */
#define   US_MR_USART_MSBF_MSBF_Val       0x1u   /**< \brief (US_MR_USART) Most Significant Bit first */
#define US_MR_USART_MSBF_LSBF       (US_MR_USART_MSBF_LSBF_Val     << US_MR_USART_MSBF_Pos)
#define US_MR_USART_MSBF_MSBF       (US_MR_USART_MSBF_MSBF_Val     << US_MR_USART_MSBF_Pos)
#define US_MR_USART_MODE9_Pos       17           /**< \brief (US_MR_USART) 9-bit Character Length */
#define US_MR_USART_MODE9           (0x1u << US_MR_USART_MODE9_Pos)
#define   US_MR_USART_MODE9_0_Val         0x0u   /**< \brief (US_MR_USART) CHRL defines character length */
#define   US_MR_USART_MODE9_1_Val         0x1u   /**< \brief (US_MR_USART) 9-bit character length */
#define US_MR_USART_MODE9_0         (US_MR_USART_MODE9_0_Val       << US_MR_USART_MODE9_Pos)
#define US_MR_USART_MODE9_1         (US_MR_USART_MODE9_1_Val       << US_MR_USART_MODE9_Pos)
#define US_MR_USART_CLKO_Pos        18           /**< \brief (US_MR_USART) Clock Output Select */
#define US_MR_USART_CLKO            (0x1u << US_MR_USART_CLKO_Pos)
#define   US_MR_USART_CLKO_0_Val          0x0u   /**< \brief (US_MR_USART) The USART does not drive the SCK pin */
#define   US_MR_USART_CLKO_1_Val          0x1u   /**< \brief (US_MR_USART) The USART drives the SCK pin if USCLKS does not select the external clock SCK */
#define US_MR_USART_CLKO_0          (US_MR_USART_CLKO_0_Val        << US_MR_USART_CLKO_Pos)
#define US_MR_USART_CLKO_1          (US_MR_USART_CLKO_1_Val        << US_MR_USART_CLKO_Pos)
#define US_MR_USART_OVER_Pos        19           /**< \brief (US_MR_USART) Oversampling Mode */
#define US_MR_USART_OVER            (0x1u << US_MR_USART_OVER_Pos)
#define   US_MR_USART_OVER_X16_Val        0x0u   /**< \brief (US_MR_USART) 16x Oversampling */
#define   US_MR_USART_OVER_X8_Val         0x1u   /**< \brief (US_MR_USART) 8x Oversampling */
#define US_MR_USART_OVER_X16        (US_MR_USART_OVER_X16_Val      << US_MR_USART_OVER_Pos)
#define US_MR_USART_OVER_X8         (US_MR_USART_OVER_X8_Val       << US_MR_USART_OVER_Pos)
#define US_MR_USART_INACK_Pos       20           /**< \brief (US_MR_USART) Inhibit Non Acknowledge */
#define US_MR_USART_INACK           (0x1u << US_MR_USART_INACK_Pos)
#define   US_MR_USART_INACK_0_Val         0x0u   /**< \brief (US_MR_USART) The NACK is generated */
#define   US_MR_USART_INACK_1_Val         0x1u   /**< \brief (US_MR_USART) The NACK is not generated */
#define US_MR_USART_INACK_0         (US_MR_USART_INACK_0_Val       << US_MR_USART_INACK_Pos)
#define US_MR_USART_INACK_1         (US_MR_USART_INACK_1_Val       << US_MR_USART_INACK_Pos)
#define US_MR_USART_DSNACK_Pos      21           /**< \brief (US_MR_USART) Disable Successive NACK */
#define US_MR_USART_DSNACK          (0x1u << US_MR_USART_DSNACK_Pos)
#define   US_MR_USART_DSNACK_0_Val        0x0u   /**< \brief (US_MR_USART) NACK is sent on the ISO line as soon as a parity error occurs in the received character (unless INACK is set) */
#define   US_MR_USART_DSNACK_1_Val        0x1u   /**< \brief (US_MR_USART) Successive parity errors are counted up to the value specified in the MAX_ITERATION field. These parity errors generatea NACK on the ISO line. As soon as this value is reached, no additional NACK is sent on the ISO line. The flag ITERATION is asserted */
#define US_MR_USART_DSNACK_0        (US_MR_USART_DSNACK_0_Val      << US_MR_USART_DSNACK_Pos)
#define US_MR_USART_DSNACK_1        (US_MR_USART_DSNACK_1_Val      << US_MR_USART_DSNACK_Pos)
#define US_MR_USART_VAR_SYNC_Pos    22           /**< \brief (US_MR_USART) Variable synchronization of command/data sync Start Frame Delimiter */
#define US_MR_USART_VAR_SYNC        (0x1u << US_MR_USART_VAR_SYNC_Pos)
#define   US_MR_USART_VAR_SYNC_0_Val      0x0u   /**< \brief (US_MR_USART) User defined configuration of command or data sync field depending on SYNC value */
#define   US_MR_USART_VAR_SYNC_1_Val      0x1u   /**< \brief (US_MR_USART) The sync field is updated when a character is written into THR register */
#define US_MR_USART_VAR_SYNC_0      (US_MR_USART_VAR_SYNC_0_Val    << US_MR_USART_VAR_SYNC_Pos)
#define US_MR_USART_VAR_SYNC_1      (US_MR_USART_VAR_SYNC_1_Val    << US_MR_USART_VAR_SYNC_Pos)
#define US_MR_USART_INVDATA_Pos     23           /**< \brief (US_MR_USART) Inverted data */
#define US_MR_USART_INVDATA         (0x1u << US_MR_USART_INVDATA_Pos)
#define US_MR_USART_MAX_ITERATION_Pos 24           /**< \brief (US_MR_USART) Max interation */
#define US_MR_USART_MAX_ITERATION_Msk (0x7u << US_MR_USART_MAX_ITERATION_Pos)
#define US_MR_USART_MAX_ITERATION(value) ((US_MR_USART_MAX_ITERATION_Msk & ((value) << US_MR_USART_MAX_ITERATION_Pos)))
#define US_MR_USART_FILTER_Pos      28           /**< \brief (US_MR_USART) Infrared Receive Line Filter */
#define US_MR_USART_FILTER          (0x1u << US_MR_USART_FILTER_Pos)
#define   US_MR_USART_FILTER_0_Val        0x0u   /**< \brief (US_MR_USART) The USART does not filter the receive line */
#define   US_MR_USART_FILTER_1_Val        0x1u   /**< \brief (US_MR_USART) The USART filters the receive line using a three-sample filter (1/16-bit clock) (2 over 3 majority) */
#define US_MR_USART_FILTER_0        (US_MR_USART_FILTER_0_Val      << US_MR_USART_FILTER_Pos)
#define US_MR_USART_FILTER_1        (US_MR_USART_FILTER_1_Val      << US_MR_USART_FILTER_Pos)
#define US_MR_USART_MAN_Pos         29           /**< \brief (US_MR_USART) Manchester Encoder/Decoder Enable */
#define US_MR_USART_MAN             (0x1u << US_MR_USART_MAN_Pos)
#define   US_MR_USART_MAN_0_Val           0x0u   /**< \brief (US_MR_USART) Manchester Encoder/Decoder is disabled */
#define   US_MR_USART_MAN_1_Val           0x1u   /**< \brief (US_MR_USART) Manchester Encoder/Decoder is enabled */
#define US_MR_USART_MAN_0           (US_MR_USART_MAN_0_Val         << US_MR_USART_MAN_Pos)
#define US_MR_USART_MAN_1           (US_MR_USART_MAN_1_Val         << US_MR_USART_MAN_Pos)
#define US_MR_USART_MODSYNC_Pos     30           /**< \brief (US_MR_USART) Manchester Synchronization Mode */
#define US_MR_USART_MODSYNC         (0x1u << US_MR_USART_MODSYNC_Pos)
#define   US_MR_USART_MODSYNC_0_Val       0x0u   /**< \brief (US_MR_USART) The Manchester Start bit is a 0 to 1 transition */
#define   US_MR_USART_MODSYNC_1_Val       0x1u   /**< \brief (US_MR_USART) The Manchester Start bit is a 1 to 0 transition */
#define US_MR_USART_MODSYNC_0       (US_MR_USART_MODSYNC_0_Val     << US_MR_USART_MODSYNC_Pos)
#define US_MR_USART_MODSYNC_1       (US_MR_USART_MODSYNC_1_Val     << US_MR_USART_MODSYNC_Pos)
#define US_MR_USART_ONEBIT_Pos      31           /**< \brief (US_MR_USART) Start Frame Delimiter selector */
#define US_MR_USART_ONEBIT          (0x1u << US_MR_USART_ONEBIT_Pos)
#define   US_MR_USART_ONEBIT_0_Val        0x0u   /**< \brief (US_MR_USART) Start Frame delimiter is COMMAND or DATA SYNC */
#define   US_MR_USART_ONEBIT_1_Val        0x1u   /**< \brief (US_MR_USART) Start Frame delimiter is One Bit */
#define US_MR_USART_ONEBIT_0        (US_MR_USART_ONEBIT_0_Val      << US_MR_USART_ONEBIT_Pos)
#define US_MR_USART_ONEBIT_1        (US_MR_USART_ONEBIT_1_Val      << US_MR_USART_ONEBIT_Pos)
#define US_MR_USART_MASK            0xF7FFFFFFu  /**< \brief (US_MR_USART) MASK Register */

