synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/usart.h
/* -------- US_IDR : (USART Offset: 0x0C) ( /W 32) Interrupt Disable Register -------- */
#define US_IDR_OFFSET               0x0C         /**< \brief (US_IDR offset) Interrupt Disable Register */
#define US_IDR_RESETVALUE           0x00000000   /**< \brief (US_IDR reset_value) Interrupt Disable Register */

// LIN mode
#define US_IDR_LIN_RXRDY_Pos        0            /**< \brief (US_IDR_LIN) Receiver Ready Interrupt Disable */
#define US_IDR_LIN_RXRDY            (0x1u << US_IDR_LIN_RXRDY_Pos)
#define   US_IDR_LIN_RXRDY_0_Val          0x0u   /**< \brief (US_IDR_LIN) No Effect */
#define   US_IDR_LIN_RXRDY_1_Val          0x1u   /**< \brief (US_IDR_LIN) Disables the interrupt */
#define US_IDR_LIN_RXRDY_0          (US_IDR_LIN_RXRDY_0_Val        << US_IDR_LIN_RXRDY_Pos)
#define US_IDR_LIN_RXRDY_1          (US_IDR_LIN_RXRDY_1_Val        << US_IDR_LIN_RXRDY_Pos)
#define US_IDR_LIN_TXRDY_Pos        1            /**< \brief (US_IDR_LIN) Transmitter Ready Interrupt Disable */
#define US_IDR_LIN_TXRDY            (0x1u << US_IDR_LIN_TXRDY_Pos)
#define   US_IDR_LIN_TXRDY_0_Val          0x0u   /**< \brief (US_IDR_LIN) No Effect */
#define   US_IDR_LIN_TXRDY_1_Val          0x1u   /**< \brief (US_IDR_LIN) Disables the interrupt */
#define US_IDR_LIN_TXRDY_0          (US_IDR_LIN_TXRDY_0_Val        << US_IDR_LIN_TXRDY_Pos)
#define US_IDR_LIN_TXRDY_1          (US_IDR_LIN_TXRDY_1_Val        << US_IDR_LIN_TXRDY_Pos)
#define US_IDR_LIN_RXBRK_Pos        2            /**< \brief (US_IDR_LIN) Receiver Break Interrupt Disable */
#define US_IDR_LIN_RXBRK            (0x1u << US_IDR_LIN_RXBRK_Pos)
#define   US_IDR_LIN_RXBRK_0_Val          0x0u   /**< \brief (US_IDR_LIN) No Effect */
#define   US_IDR_LIN_RXBRK_1_Val          0x1u   /**< \brief (US_IDR_LIN) Disables the interrupt */
#define US_IDR_LIN_RXBRK_0          (US_IDR_LIN_RXBRK_0_Val        << US_IDR_LIN_RXBRK_Pos)
#define US_IDR_LIN_RXBRK_1          (US_IDR_LIN_RXBRK_1_Val        << US_IDR_LIN_RXBRK_Pos)
#define US_IDR_LIN_OVRE_Pos         5            /**< \brief (US_IDR_LIN) Overrun Error Interrupt Disable */
#define US_IDR_LIN_OVRE             (0x1u << US_IDR_LIN_OVRE_Pos)
#define   US_IDR_LIN_OVRE_0_Val           0x0u   /**< \brief (US_IDR_LIN) No Effect */
#define   US_IDR_LIN_OVRE_1_Val           0x1u   /**< \brief (US_IDR_LIN) Disables the interrupt */
#define US_IDR_LIN_OVRE_0           (US_IDR_LIN_OVRE_0_Val         << US_IDR_LIN_OVRE_Pos)
#define US_IDR_LIN_OVRE_1           (US_IDR_LIN_OVRE_1_Val         << US_IDR_LIN_OVRE_Pos)
#define US_IDR_LIN_FRAME_Pos        6            /**< \brief (US_IDR_LIN) Framing Error Interrupt Disable */
#define US_IDR_LIN_FRAME            (0x1u << US_IDR_LIN_FRAME_Pos)
#define   US_IDR_LIN_FRAME_0_Val          0x0u   /**< \brief (US_IDR_LIN) No Effect */
#define   US_IDR_LIN_FRAME_1_Val          0x1u   /**< \brief (US_IDR_LIN) Disables the interrupt */
#define US_IDR_LIN_FRAME_0          (US_IDR_LIN_FRAME_0_Val        << US_IDR_LIN_FRAME_Pos)
#define US_IDR_LIN_FRAME_1          (US_IDR_LIN_FRAME_1_Val        << US_IDR_LIN_FRAME_Pos)
#define US_IDR_LIN_PARE_Pos         7            /**< \brief (US_IDR_LIN) Parity Error Interrupt Disable */
#define US_IDR_LIN_PARE             (0x1u << US_IDR_LIN_PARE_Pos)
#define   US_IDR_LIN_PARE_0_Val           0x0u   /**< \brief (US_IDR_LIN) No Effect */
#define   US_IDR_LIN_PARE_1_Val           0x1u   /**< \brief (US_IDR_LIN) Disables the interrupt */
#define US_IDR_LIN_PARE_0           (US_IDR_LIN_PARE_0_Val         << US_IDR_LIN_PARE_Pos)
#define US_IDR_LIN_PARE_1           (US_IDR_LIN_PARE_1_Val         << US_IDR_LIN_PARE_Pos)
#define US_IDR_LIN_TIMEOUT_Pos      8            /**< \brief (US_IDR_LIN) Time-out Interrupt Disable */
#define US_IDR_LIN_TIMEOUT          (0x1u << US_IDR_LIN_TIMEOUT_Pos)
#define   US_IDR_LIN_TIMEOUT_0_Val        0x0u   /**< \brief (US_IDR_LIN) No Effect */
#define   US_IDR_LIN_TIMEOUT_1_Val        0x1u   /**< \brief (US_IDR_LIN) Disables the interrupt */
#define US_IDR_LIN_TIMEOUT_0        (US_IDR_LIN_TIMEOUT_0_Val      << US_IDR_LIN_TIMEOUT_Pos)
#define US_IDR_LIN_TIMEOUT_1        (US_IDR_LIN_TIMEOUT_1_Val      << US_IDR_LIN_TIMEOUT_Pos)
#define US_IDR_LIN_TXEMPTY_Pos      9            /**< \brief (US_IDR_LIN) Transmitter Empty Interrupt Disable */
#define US_IDR_LIN_TXEMPTY          (0x1u << US_IDR_LIN_TXEMPTY_Pos)
#define   US_IDR_LIN_TXEMPTY_0_Val        0x0u   /**< \brief (US_IDR_LIN) No Effect */
#define   US_IDR_LIN_TXEMPTY_1_Val        0x1u   /**< \brief (US_IDR_LIN) Disables the interrupt */
#define US_IDR_LIN_TXEMPTY_0        (US_IDR_LIN_TXEMPTY_0_Val      << US_IDR_LIN_TXEMPTY_Pos)
#define US_IDR_LIN_TXEMPTY_1        (US_IDR_LIN_TXEMPTY_1_Val      << US_IDR_LIN_TXEMPTY_Pos)
#define US_IDR_LIN_ITER_Pos         10           /**< \brief (US_IDR_LIN) Iteration Interrupt Disable */
#define US_IDR_LIN_ITER             (0x1u << US_IDR_LIN_ITER_Pos)
#define   US_IDR_LIN_ITER_0_Val           0x0u   /**< \brief (US_IDR_LIN) No Effect */
#define   US_IDR_LIN_ITER_1_Val           0x1u   /**< \brief (US_IDR_LIN) Disables the interrupt */
#define US_IDR_LIN_ITER_0           (US_IDR_LIN_ITER_0_Val         << US_IDR_LIN_ITER_Pos)
#define US_IDR_LIN_ITER_1           (US_IDR_LIN_ITER_1_Val         << US_IDR_LIN_ITER_Pos)
#define US_IDR_LIN_TXBUFE_Pos       11           /**< \brief (US_IDR_LIN) Buffer Empty Interrupt Disable */
#define US_IDR_LIN_TXBUFE           (0x1u << US_IDR_LIN_TXBUFE_Pos)
#define   US_IDR_LIN_TXBUFE_0_Val         0x0u   /**< \brief (US_IDR_LIN) No Effect */
#define   US_IDR_LIN_TXBUFE_1_Val         0x1u   /**< \brief (US_IDR_LIN) Disables the interrupt */
#define US_IDR_LIN_TXBUFE_0         (US_IDR_LIN_TXBUFE_0_Val       << US_IDR_LIN_TXBUFE_Pos)
#define US_IDR_LIN_TXBUFE_1         (US_IDR_LIN_TXBUFE_1_Val       << US_IDR_LIN_TXBUFE_Pos)
#define US_IDR_LIN_RXBUFF_Pos       12           /**< \brief (US_IDR_LIN) Buffer Full Interrupt Disable */
#define US_IDR_LIN_RXBUFF           (0x1u << US_IDR_LIN_RXBUFF_Pos)
#define   US_IDR_LIN_RXBUFF_0_Val         0x0u   /**< \brief (US_IDR_LIN) No Effect */
#define   US_IDR_LIN_RXBUFF_1_Val         0x1u   /**< \brief (US_IDR_LIN) Disables the interrupt */
#define US_IDR_LIN_RXBUFF_0         (US_IDR_LIN_RXBUFF_0_Val       << US_IDR_LIN_RXBUFF_Pos)
#define US_IDR_LIN_RXBUFF_1         (US_IDR_LIN_RXBUFF_1_Val       << US_IDR_LIN_RXBUFF_Pos)
#define US_IDR_LIN_NACK_Pos         13           /**< \brief (US_IDR_LIN) Non Acknowledge  or LIN Break Sent or LIN Break Received Interrupt Disable */
#define US_IDR_LIN_NACK             (0x1u << US_IDR_LIN_NACK_Pos)
#define   US_IDR_LIN_NACK_0_Val           0x0u   /**< \brief (US_IDR_LIN) No Effect */
#define   US_IDR_LIN_NACK_1_Val           0x1u   /**< \brief (US_IDR_LIN) Disables the interrupt */
#define US_IDR_LIN_NACK_0           (US_IDR_LIN_NACK_0_Val         << US_IDR_LIN_NACK_Pos)
#define US_IDR_LIN_NACK_1           (US_IDR_LIN_NACK_1_Val         << US_IDR_LIN_NACK_Pos)
#define US_IDR_LIN_LINID_Pos        14           /**< \brief (US_IDR_LIN) LIN Identifier Sent or LIN Identifier Received Interrupt Disable */
#define US_IDR_LIN_LINID            (0x1u << US_IDR_LIN_LINID_Pos)
#define US_IDR_LIN_LINTC_Pos        15           /**< \brief (US_IDR_LIN) LIN Transfer Conpleted Interrupt Disable */
#define US_IDR_LIN_LINTC            (0x1u << US_IDR_LIN_LINTC_Pos)
#define US_IDR_LIN_RIIC_Pos         16           /**< \brief (US_IDR_LIN) Ring Indicator Input Change Disable */
#define US_IDR_LIN_RIIC             (0x1u << US_IDR_LIN_RIIC_Pos)
#define   US_IDR_LIN_RIIC_0_Val           0x0u   /**< \brief (US_IDR_LIN) No Effect */
#define   US_IDR_LIN_RIIC_1_Val           0x1u   /**< \brief (US_IDR_LIN) Disables the interrupt */
#define US_IDR_LIN_RIIC_0           (US_IDR_LIN_RIIC_0_Val         << US_IDR_LIN_RIIC_Pos)
#define US_IDR_LIN_RIIC_1           (US_IDR_LIN_RIIC_1_Val         << US_IDR_LIN_RIIC_Pos)
#define US_IDR_LIN_DSRIC_Pos        17           /**< \brief (US_IDR_LIN) Data Set Ready Input Change Disable */
#define US_IDR_LIN_DSRIC            (0x1u << US_IDR_LIN_DSRIC_Pos)
#define   US_IDR_LIN_DSRIC_0_Val          0x0u   /**< \brief (US_IDR_LIN) No Effect */
#define   US_IDR_LIN_DSRIC_1_Val          0x1u   /**< \brief (US_IDR_LIN) Disables the interrupt */
#define US_IDR_LIN_DSRIC_0          (US_IDR_LIN_DSRIC_0_Val        << US_IDR_LIN_DSRIC_Pos)
#define US_IDR_LIN_DSRIC_1          (US_IDR_LIN_DSRIC_1_Val        << US_IDR_LIN_DSRIC_Pos)
#define US_IDR_LIN_DCDIC_Pos        18           /**< \brief (US_IDR_LIN) Data Carrier Detect Input Change Interrupt Disable */
#define US_IDR_LIN_DCDIC            (0x1u << US_IDR_LIN_DCDIC_Pos)
#define   US_IDR_LIN_DCDIC_0_Val          0x0u   /**< \brief (US_IDR_LIN) No Effect */
#define   US_IDR_LIN_DCDIC_1_Val          0x1u   /**< \brief (US_IDR_LIN) Disables the interrupt */
#define US_IDR_LIN_DCDIC_0          (US_IDR_LIN_DCDIC_0_Val        << US_IDR_LIN_DCDIC_Pos)
#define US_IDR_LIN_DCDIC_1          (US_IDR_LIN_DCDIC_1_Val        << US_IDR_LIN_DCDIC_Pos)
#define US_IDR_LIN_CTSIC_Pos        19           /**< \brief (US_IDR_LIN) Clear to Send Input Change Interrupt Disable */
#define US_IDR_LIN_CTSIC            (0x1u << US_IDR_LIN_CTSIC_Pos)
#define   US_IDR_LIN_CTSIC_0_Val          0x0u   /**< \brief (US_IDR_LIN) No Effect */
#define   US_IDR_LIN_CTSIC_1_Val          0x1u   /**< \brief (US_IDR_LIN) Disables the interrupt */
#define US_IDR_LIN_CTSIC_0          (US_IDR_LIN_CTSIC_0_Val        << US_IDR_LIN_CTSIC_Pos)
#define US_IDR_LIN_CTSIC_1          (US_IDR_LIN_CTSIC_1_Val        << US_IDR_LIN_CTSIC_Pos)
#define US_IDR_LIN_LINBE_Pos        25           /**< \brief (US_IDR_LIN) LIN Bus Error Interrupt Disable */
#define US_IDR_LIN_LINBE            (0x1u << US_IDR_LIN_LINBE_Pos)
#define US_IDR_LIN_LINISFE_Pos      26           /**< \brief (US_IDR_LIN) LIN Inconsistent Synch Field Error Interrupt Disable */
#define US_IDR_LIN_LINISFE          (0x1u << US_IDR_LIN_LINISFE_Pos)
#define US_IDR_LIN_LINIPE_Pos       27           /**< \brief (US_IDR_LIN) LIN Identifier Parity Interrupt Disable */
#define US_IDR_LIN_LINIPE           (0x1u << US_IDR_LIN_LINIPE_Pos)
#define US_IDR_LIN_LINCE_Pos        28           /**< \brief (US_IDR_LIN) LIN Checksum Error Interrupt Disable */
#define US_IDR_LIN_LINCE            (0x1u << US_IDR_LIN_LINCE_Pos)
#define US_IDR_LIN_LINSNRE_Pos      29           /**< \brief (US_IDR_LIN) LIN Slave Not Responding Error Interrupt Disable */
#define US_IDR_LIN_LINSNRE          (0x1u << US_IDR_LIN_LINSNRE_Pos)
#define US_IDR_LIN_LINSTE_Pos       30           /**< \brief (US_IDR_LIN) LIN Synch Tolerance Error Interrupt Disable */
#define US_IDR_LIN_LINSTE           (0x1u << US_IDR_LIN_LINSTE_Pos)
#define   US_IDR_LIN_LINSTE_0_Val         0x0u   /**< \brief (US_IDR_LIN) No Effect */
#define   US_IDR_LIN_LINSTE_1_Val         0x1u   /**< \brief (US_IDR_LIN) Disables the interrupt */
#define US_IDR_LIN_LINSTE_0         (US_IDR_LIN_LINSTE_0_Val       << US_IDR_LIN_LINSTE_Pos)
#define US_IDR_LIN_LINSTE_1         (US_IDR_LIN_LINSTE_1_Val       << US_IDR_LIN_LINSTE_Pos)
#define US_IDR_LIN_LINHTE_Pos       31           /**< \brief (US_IDR_LIN) LIN Header Timeout Error Interrupt Disable */
#define US_IDR_LIN_LINHTE           (0x1u << US_IDR_LIN_LINHTE_Pos)
#define   US_IDR_LIN_LINHTE_0_Val         0x0u   /**< \brief (US_IDR_LIN) No Effect */
#define   US_IDR_LIN_LINHTE_1_Val         0x1u   /**< \brief (US_IDR_LIN) Disables the interrupt */
#define US_IDR_LIN_LINHTE_0         (US_IDR_LIN_LINHTE_0_Val       << US_IDR_LIN_LINHTE_Pos)
#define US_IDR_LIN_LINHTE_1         (US_IDR_LIN_LINHTE_1_Val       << US_IDR_LIN_LINHTE_Pos)
#define US_IDR_LIN_MASK             0xFE0FFFE7u  /**< \brief (US_IDR_LIN) MASK Register */

// SPI_SLAVE mode
#define US_IDR_SPI_SLAVE_RXRDY_Pos  0            /**< \brief (US_IDR_SPI_SLAVE) Receiver Ready Interrupt Disable */
#define US_IDR_SPI_SLAVE_RXRDY      (0x1u << US_IDR_SPI_SLAVE_RXRDY_Pos)
#define   US_IDR_SPI_SLAVE_RXRDY_0_Val    0x0u   /**< \brief (US_IDR_SPI_SLAVE) No Effect */
#define   US_IDR_SPI_SLAVE_RXRDY_1_Val    0x1u   /**< \brief (US_IDR_SPI_SLAVE) Disables the interrupt */
#define US_IDR_SPI_SLAVE_RXRDY_0    (US_IDR_SPI_SLAVE_RXRDY_0_Val  << US_IDR_SPI_SLAVE_RXRDY_Pos)
#define US_IDR_SPI_SLAVE_RXRDY_1    (US_IDR_SPI_SLAVE_RXRDY_1_Val  << US_IDR_SPI_SLAVE_RXRDY_Pos)
#define US_IDR_SPI_SLAVE_TXRDY_Pos  1            /**< \brief (US_IDR_SPI_SLAVE) Transmitter Ready Interrupt Disable */
#define US_IDR_SPI_SLAVE_TXRDY      (0x1u << US_IDR_SPI_SLAVE_TXRDY_Pos)
#define   US_IDR_SPI_SLAVE_TXRDY_0_Val    0x0u   /**< \brief (US_IDR_SPI_SLAVE) No Effect */
#define   US_IDR_SPI_SLAVE_TXRDY_1_Val    0x1u   /**< \brief (US_IDR_SPI_SLAVE) Disables the interrupt */
#define US_IDR_SPI_SLAVE_TXRDY_0    (US_IDR_SPI_SLAVE_TXRDY_0_Val  << US_IDR_SPI_SLAVE_TXRDY_Pos)
#define US_IDR_SPI_SLAVE_TXRDY_1    (US_IDR_SPI_SLAVE_TXRDY_1_Val  << US_IDR_SPI_SLAVE_TXRDY_Pos)
#define US_IDR_SPI_SLAVE_RXBRK_Pos  2            /**< \brief (US_IDR_SPI_SLAVE) Receiver Break Interrupt Disable */
#define US_IDR_SPI_SLAVE_RXBRK      (0x1u << US_IDR_SPI_SLAVE_RXBRK_Pos)
#define   US_IDR_SPI_SLAVE_RXBRK_0_Val    0x0u   /**< \brief (US_IDR_SPI_SLAVE) No Effect */
#define   US_IDR_SPI_SLAVE_RXBRK_1_Val    0x1u   /**< \brief (US_IDR_SPI_SLAVE) Disables the interrupt */
#define US_IDR_SPI_SLAVE_RXBRK_0    (US_IDR_SPI_SLAVE_RXBRK_0_Val  << US_IDR_SPI_SLAVE_RXBRK_Pos)
#define US_IDR_SPI_SLAVE_RXBRK_1    (US_IDR_SPI_SLAVE_RXBRK_1_Val  << US_IDR_SPI_SLAVE_RXBRK_Pos)
#define US_IDR_SPI_SLAVE_OVRE_Pos   5            /**< \brief (US_IDR_SPI_SLAVE) Overrun Error Interrupt Disable */
#define US_IDR_SPI_SLAVE_OVRE       (0x1u << US_IDR_SPI_SLAVE_OVRE_Pos)
#define   US_IDR_SPI_SLAVE_OVRE_0_Val     0x0u   /**< \brief (US_IDR_SPI_SLAVE) No Effect */
#define   US_IDR_SPI_SLAVE_OVRE_1_Val     0x1u   /**< \brief (US_IDR_SPI_SLAVE) Disables the interrupt */
#define US_IDR_SPI_SLAVE_OVRE_0     (US_IDR_SPI_SLAVE_OVRE_0_Val   << US_IDR_SPI_SLAVE_OVRE_Pos)
#define US_IDR_SPI_SLAVE_OVRE_1     (US_IDR_SPI_SLAVE_OVRE_1_Val   << US_IDR_SPI_SLAVE_OVRE_Pos)
#define US_IDR_SPI_SLAVE_FRAME_Pos  6            /**< \brief (US_IDR_SPI_SLAVE) Framing Error Interrupt Disable */
#define US_IDR_SPI_SLAVE_FRAME      (0x1u << US_IDR_SPI_SLAVE_FRAME_Pos)
#define   US_IDR_SPI_SLAVE_FRAME_0_Val    0x0u   /**< \brief (US_IDR_SPI_SLAVE) No Effect */
#define   US_IDR_SPI_SLAVE_FRAME_1_Val    0x1u   /**< \brief (US_IDR_SPI_SLAVE) Disables the interrupt */
#define US_IDR_SPI_SLAVE_FRAME_0    (US_IDR_SPI_SLAVE_FRAME_0_Val  << US_IDR_SPI_SLAVE_FRAME_Pos)
#define US_IDR_SPI_SLAVE_FRAME_1    (US_IDR_SPI_SLAVE_FRAME_1_Val  << US_IDR_SPI_SLAVE_FRAME_Pos)
#define US_IDR_SPI_SLAVE_PARE_Pos   7            /**< \brief (US_IDR_SPI_SLAVE) Parity Error Interrupt Disable */
#define US_IDR_SPI_SLAVE_PARE       (0x1u << US_IDR_SPI_SLAVE_PARE_Pos)
#define   US_IDR_SPI_SLAVE_PARE_0_Val     0x0u   /**< \brief (US_IDR_SPI_SLAVE) No Effect */
#define   US_IDR_SPI_SLAVE_PARE_1_Val     0x1u   /**< \brief (US_IDR_SPI_SLAVE) Disables the interrupt */
#define US_IDR_SPI_SLAVE_PARE_0     (US_IDR_SPI_SLAVE_PARE_0_Val   << US_IDR_SPI_SLAVE_PARE_Pos)
#define US_IDR_SPI_SLAVE_PARE_1     (US_IDR_SPI_SLAVE_PARE_1_Val   << US_IDR_SPI_SLAVE_PARE_Pos)
#define US_IDR_SPI_SLAVE_TIMEOUT_Pos 8            /**< \brief (US_IDR_SPI_SLAVE) Time-out Interrupt Disable */
#define US_IDR_SPI_SLAVE_TIMEOUT    (0x1u << US_IDR_SPI_SLAVE_TIMEOUT_Pos)
#define   US_IDR_SPI_SLAVE_TIMEOUT_0_Val  0x0u   /**< \brief (US_IDR_SPI_SLAVE) No Effect */
#define   US_IDR_SPI_SLAVE_TIMEOUT_1_Val  0x1u   /**< \brief (US_IDR_SPI_SLAVE) Disables the interrupt */
#define US_IDR_SPI_SLAVE_TIMEOUT_0  (US_IDR_SPI_SLAVE_TIMEOUT_0_Val << US_IDR_SPI_SLAVE_TIMEOUT_Pos)
#define US_IDR_SPI_SLAVE_TIMEOUT_1  (US_IDR_SPI_SLAVE_TIMEOUT_1_Val << US_IDR_SPI_SLAVE_TIMEOUT_Pos)
#define US_IDR_SPI_SLAVE_TXEMPTY_Pos 9            /**< \brief (US_IDR_SPI_SLAVE) Transmitter Empty Interrupt Disable */
#define US_IDR_SPI_SLAVE_TXEMPTY    (0x1u << US_IDR_SPI_SLAVE_TXEMPTY_Pos)
#define   US_IDR_SPI_SLAVE_TXEMPTY_0_Val  0x0u   /**< \brief (US_IDR_SPI_SLAVE) No Effect */
#define   US_IDR_SPI_SLAVE_TXEMPTY_1_Val  0x1u   /**< \brief (US_IDR_SPI_SLAVE) Disables the interrupt */
#define US_IDR_SPI_SLAVE_TXEMPTY_0  (US_IDR_SPI_SLAVE_TXEMPTY_0_Val << US_IDR_SPI_SLAVE_TXEMPTY_Pos)
#define US_IDR_SPI_SLAVE_TXEMPTY_1  (US_IDR_SPI_SLAVE_TXEMPTY_1_Val << US_IDR_SPI_SLAVE_TXEMPTY_Pos)
#define US_IDR_SPI_SLAVE_UNRE_Pos   10           /**< \brief (US_IDR_SPI_SLAVE) SPI Underrun Error Interrupt Disable */
#define US_IDR_SPI_SLAVE_UNRE       (0x1u << US_IDR_SPI_SLAVE_UNRE_Pos)
#define   US_IDR_SPI_SLAVE_UNRE_0_Val     0x0u   /**< \brief (US_IDR_SPI_SLAVE) No Effect */
#define   US_IDR_SPI_SLAVE_UNRE_1_Val     0x1u   /**< \brief (US_IDR_SPI_SLAVE) Disables the interrupt */
#define US_IDR_SPI_SLAVE_UNRE_0     (US_IDR_SPI_SLAVE_UNRE_0_Val   << US_IDR_SPI_SLAVE_UNRE_Pos)
#define US_IDR_SPI_SLAVE_UNRE_1     (US_IDR_SPI_SLAVE_UNRE_1_Val   << US_IDR_SPI_SLAVE_UNRE_Pos)
#define US_IDR_SPI_SLAVE_TXBUFE_Pos 11           /**< \brief (US_IDR_SPI_SLAVE) Buffer Empty Interrupt Disable */
#define US_IDR_SPI_SLAVE_TXBUFE     (0x1u << US_IDR_SPI_SLAVE_TXBUFE_Pos)
#define   US_IDR_SPI_SLAVE_TXBUFE_0_Val   0x0u   /**< \brief (US_IDR_SPI_SLAVE) No Effect */
#define   US_IDR_SPI_SLAVE_TXBUFE_1_Val   0x1u   /**< \brief (US_IDR_SPI_SLAVE) Disables the interrupt */
#define US_IDR_SPI_SLAVE_TXBUFE_0   (US_IDR_SPI_SLAVE_TXBUFE_0_Val << US_IDR_SPI_SLAVE_TXBUFE_Pos)
#define US_IDR_SPI_SLAVE_TXBUFE_1   (US_IDR_SPI_SLAVE_TXBUFE_1_Val << US_IDR_SPI_SLAVE_TXBUFE_Pos)
#define US_IDR_SPI_SLAVE_RXBUFF_Pos 12           /**< \brief (US_IDR_SPI_SLAVE) Buffer Full Interrupt Disable */
#define US_IDR_SPI_SLAVE_RXBUFF     (0x1u << US_IDR_SPI_SLAVE_RXBUFF_Pos)
#define   US_IDR_SPI_SLAVE_RXBUFF_0_Val   0x0u   /**< \brief (US_IDR_SPI_SLAVE) No Effect */
#define   US_IDR_SPI_SLAVE_RXBUFF_1_Val   0x1u   /**< \brief (US_IDR_SPI_SLAVE) Disables the interrupt */
#define US_IDR_SPI_SLAVE_RXBUFF_0   (US_IDR_SPI_SLAVE_RXBUFF_0_Val << US_IDR_SPI_SLAVE_RXBUFF_Pos)
#define US_IDR_SPI_SLAVE_RXBUFF_1   (US_IDR_SPI_SLAVE_RXBUFF_1_Val << US_IDR_SPI_SLAVE_RXBUFF_Pos)
#define US_IDR_SPI_SLAVE_NACK_Pos   13           /**< \brief (US_IDR_SPI_SLAVE) Non Acknowledge Interrupt Disable */
#define US_IDR_SPI_SLAVE_NACK       (0x1u << US_IDR_SPI_SLAVE_NACK_Pos)
#define   US_IDR_SPI_SLAVE_NACK_0_Val     0x0u   /**< \brief (US_IDR_SPI_SLAVE) No Effect */
#define   US_IDR_SPI_SLAVE_NACK_1_Val     0x1u   /**< \brief (US_IDR_SPI_SLAVE) Disables the interrupt */
#define US_IDR_SPI_SLAVE_NACK_0     (US_IDR_SPI_SLAVE_NACK_0_Val   << US_IDR_SPI_SLAVE_NACK_Pos)
#define US_IDR_SPI_SLAVE_NACK_1     (US_IDR_SPI_SLAVE_NACK_1_Val   << US_IDR_SPI_SLAVE_NACK_Pos)
#define US_IDR_SPI_SLAVE_RIIC_Pos   16           /**< \brief (US_IDR_SPI_SLAVE) Ring Indicator Input Change Disable */
#define US_IDR_SPI_SLAVE_RIIC       (0x1u << US_IDR_SPI_SLAVE_RIIC_Pos)
#define   US_IDR_SPI_SLAVE_RIIC_0_Val     0x0u   /**< \brief (US_IDR_SPI_SLAVE) No Effect */
#define   US_IDR_SPI_SLAVE_RIIC_1_Val     0x1u   /**< \brief (US_IDR_SPI_SLAVE) Disables the interrupt */
#define US_IDR_SPI_SLAVE_RIIC_0     (US_IDR_SPI_SLAVE_RIIC_0_Val   << US_IDR_SPI_SLAVE_RIIC_Pos)
#define US_IDR_SPI_SLAVE_RIIC_1     (US_IDR_SPI_SLAVE_RIIC_1_Val   << US_IDR_SPI_SLAVE_RIIC_Pos)
#define US_IDR_SPI_SLAVE_DSRIC_Pos  17           /**< \brief (US_IDR_SPI_SLAVE) Data Set Ready Input Change Disable */
#define US_IDR_SPI_SLAVE_DSRIC      (0x1u << US_IDR_SPI_SLAVE_DSRIC_Pos)
#define   US_IDR_SPI_SLAVE_DSRIC_0_Val    0x0u   /**< \brief (US_IDR_SPI_SLAVE) No Effect */
#define   US_IDR_SPI_SLAVE_DSRIC_1_Val    0x1u   /**< \brief (US_IDR_SPI_SLAVE) Disables the interrupt */
#define US_IDR_SPI_SLAVE_DSRIC_0    (US_IDR_SPI_SLAVE_DSRIC_0_Val  << US_IDR_SPI_SLAVE_DSRIC_Pos)
#define US_IDR_SPI_SLAVE_DSRIC_1    (US_IDR_SPI_SLAVE_DSRIC_1_Val  << US_IDR_SPI_SLAVE_DSRIC_Pos)
#define US_IDR_SPI_SLAVE_DCDIC_Pos  18           /**< \brief (US_IDR_SPI_SLAVE) Data Carrier Detect Input Change Interrupt Disable */
#define US_IDR_SPI_SLAVE_DCDIC      (0x1u << US_IDR_SPI_SLAVE_DCDIC_Pos)
#define   US_IDR_SPI_SLAVE_DCDIC_0_Val    0x0u   /**< \brief (US_IDR_SPI_SLAVE) No Effect */
#define   US_IDR_SPI_SLAVE_DCDIC_1_Val    0x1u   /**< \brief (US_IDR_SPI_SLAVE) Disables the interrupt */
#define US_IDR_SPI_SLAVE_DCDIC_0    (US_IDR_SPI_SLAVE_DCDIC_0_Val  << US_IDR_SPI_SLAVE_DCDIC_Pos)
#define US_IDR_SPI_SLAVE_DCDIC_1    (US_IDR_SPI_SLAVE_DCDIC_1_Val  << US_IDR_SPI_SLAVE_DCDIC_Pos)
#define US_IDR_SPI_SLAVE_CTSIC_Pos  19           /**< \brief (US_IDR_SPI_SLAVE) Clear to Send Input Change Interrupt Disable */
#define US_IDR_SPI_SLAVE_CTSIC      (0x1u << US_IDR_SPI_SLAVE_CTSIC_Pos)
#define   US_IDR_SPI_SLAVE_CTSIC_0_Val    0x0u   /**< \brief (US_IDR_SPI_SLAVE) No Effect */
#define   US_IDR_SPI_SLAVE_CTSIC_1_Val    0x1u   /**< \brief (US_IDR_SPI_SLAVE) Disables the interrupt */
#define US_IDR_SPI_SLAVE_CTSIC_0    (US_IDR_SPI_SLAVE_CTSIC_0_Val  << US_IDR_SPI_SLAVE_CTSIC_Pos)
#define US_IDR_SPI_SLAVE_CTSIC_1    (US_IDR_SPI_SLAVE_CTSIC_1_Val  << US_IDR_SPI_SLAVE_CTSIC_Pos)
#define US_IDR_SPI_SLAVE_MASK       0x000F3FE7u  /**< \brief (US_IDR_SPI_SLAVE) MASK Register */

