synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/usart.h
// LIN mode
#define US_CSR_LIN_RXRDY_Pos        0            /**< \brief (US_CSR_LIN) Receiver Ready */
#define US_CSR_LIN_RXRDY            (0x1u << US_CSR_LIN_RXRDY_Pos)
#define   US_CSR_LIN_RXRDY_0_Val          0x0u   /**< \brief (US_CSR_LIN) No complete character has been received since the last read of RHR or the receiver is disabled. If characters werebeing received when the receiver was disabled, RXRDY changes to 1 when the receiver is enabled */
#define   US_CSR_LIN_RXRDY_1_Val          0x1u   /**< \brief (US_CSR_LIN) At least one complete character has been received and RHR has not yet been read */
#define US_CSR_LIN_RXRDY_0          (US_CSR_LIN_RXRDY_0_Val        << US_CSR_LIN_RXRDY_Pos)
#define US_CSR_LIN_RXRDY_1          (US_CSR_LIN_RXRDY_1_Val        << US_CSR_LIN_RXRDY_Pos)
#define US_CSR_LIN_TXRDY_Pos        1            /**< \brief (US_CSR_LIN) Transmitter Ready */
#define US_CSR_LIN_TXRDY            (0x1u << US_CSR_LIN_TXRDY_Pos)
#define   US_CSR_LIN_TXRDY_0_Val          0x0u   /**< \brief (US_CSR_LIN) A character is in the THR waiting to be transferred to the Transmit Shift Register, or an STTBRK command has been requested, or the transmitter is disabled. As soon as the transmitter is enabled, TXRDY becomes 1 */
#define   US_CSR_LIN_TXRDY_1_Val          0x1u   /**< \brief (US_CSR_LIN) There is no character in the THR */
#define US_CSR_LIN_TXRDY_0          (US_CSR_LIN_TXRDY_0_Val        << US_CSR_LIN_TXRDY_Pos)
#define US_CSR_LIN_TXRDY_1          (US_CSR_LIN_TXRDY_1_Val        << US_CSR_LIN_TXRDY_Pos)
#define US_CSR_LIN_RXBRK_Pos        2            /**< \brief (US_CSR_LIN) Break Received/End of Break */
#define US_CSR_LIN_RXBRK            (0x1u << US_CSR_LIN_RXBRK_Pos)
#define   US_CSR_LIN_RXBRK_0_Val          0x0u   /**< \brief (US_CSR_LIN) No Break received or End of Break detected since the last RSTSTA */
#define   US_CSR_LIN_RXBRK_1_Val          0x1u   /**< \brief (US_CSR_LIN) Break Received or End of Break detected since the last RSTSTA */
#define US_CSR_LIN_RXBRK_0          (US_CSR_LIN_RXBRK_0_Val        << US_CSR_LIN_RXBRK_Pos)
#define US_CSR_LIN_RXBRK_1          (US_CSR_LIN_RXBRK_1_Val        << US_CSR_LIN_RXBRK_Pos)
#define US_CSR_LIN_OVRE_Pos         5            /**< \brief (US_CSR_LIN) Overrun Error */
#define US_CSR_LIN_OVRE             (0x1u << US_CSR_LIN_OVRE_Pos)
#define   US_CSR_LIN_OVRE_0_Val           0x0u   /**< \brief (US_CSR_LIN) No overrun error has occurred since since the last RSTSTA */
#define   US_CSR_LIN_OVRE_1_Val           0x1u   /**< \brief (US_CSR_LIN) At least one overrun error has occurred since the last RSTSTA */
#define US_CSR_LIN_OVRE_0           (US_CSR_LIN_OVRE_0_Val         << US_CSR_LIN_OVRE_Pos)
#define US_CSR_LIN_OVRE_1           (US_CSR_LIN_OVRE_1_Val         << US_CSR_LIN_OVRE_Pos)
#define US_CSR_LIN_FRAME_Pos        6            /**< \brief (US_CSR_LIN) Framing Error */
#define US_CSR_LIN_FRAME            (0x1u << US_CSR_LIN_FRAME_Pos)
#define   US_CSR_LIN_FRAME_0_Val          0x0u   /**< \brief (US_CSR_LIN) No stop bit has been detected low since the last RSTSTA */
#define   US_CSR_LIN_FRAME_1_Val          0x1u   /**< \brief (US_CSR_LIN) At least one stop bit has been detected low since the last RSTSTA */
#define US_CSR_LIN_FRAME_0          (US_CSR_LIN_FRAME_0_Val        << US_CSR_LIN_FRAME_Pos)
#define US_CSR_LIN_FRAME_1          (US_CSR_LIN_FRAME_1_Val        << US_CSR_LIN_FRAME_Pos)
#define US_CSR_LIN_PARE_Pos         7            /**< \brief (US_CSR_LIN) Parity Error */
#define US_CSR_LIN_PARE             (0x1u << US_CSR_LIN_PARE_Pos)
#define   US_CSR_LIN_PARE_0_Val           0x0u   /**< \brief (US_CSR_LIN) No parity error has been detected since the last RSTSTA */
#define   US_CSR_LIN_PARE_1_Val           0x1u   /**< \brief (US_CSR_LIN) At least one parity error has been detected since the last RSTSTA */
#define US_CSR_LIN_PARE_0           (US_CSR_LIN_PARE_0_Val         << US_CSR_LIN_PARE_Pos)
#define US_CSR_LIN_PARE_1           (US_CSR_LIN_PARE_1_Val         << US_CSR_LIN_PARE_Pos)
#define US_CSR_LIN_TIMEOUT_Pos      8            /**< \brief (US_CSR_LIN) Receiver Time-out */
#define US_CSR_LIN_TIMEOUT          (0x1u << US_CSR_LIN_TIMEOUT_Pos)
#define   US_CSR_LIN_TIMEOUT_0_Val        0x0u   /**< \brief (US_CSR_LIN) There has not been a time-out since the last Start Time-out command or the Time-out Register is 0 */
#define   US_CSR_LIN_TIMEOUT_1_Val        0x1u   /**< \brief (US_CSR_LIN) There has been a time-out since the last Start Time-out command */
#define US_CSR_LIN_TIMEOUT_0        (US_CSR_LIN_TIMEOUT_0_Val      << US_CSR_LIN_TIMEOUT_Pos)
#define US_CSR_LIN_TIMEOUT_1        (US_CSR_LIN_TIMEOUT_1_Val      << US_CSR_LIN_TIMEOUT_Pos)
#define US_CSR_LIN_TXEMPTY_Pos      9            /**< \brief (US_CSR_LIN) Transmitter Empty */
#define US_CSR_LIN_TXEMPTY          (0x1u << US_CSR_LIN_TXEMPTY_Pos)
#define   US_CSR_LIN_TXEMPTY_0_Val        0x0u   /**< \brief (US_CSR_LIN) There are characters in either THR or the Transmit Shift Register, or the transmitter is disabled */
#define   US_CSR_LIN_TXEMPTY_1_Val        0x1u   /**< \brief (US_CSR_LIN) There is at least one character in either THR or the Transmit Shift Register */
#define US_CSR_LIN_TXEMPTY_0        (US_CSR_LIN_TXEMPTY_0_Val      << US_CSR_LIN_TXEMPTY_Pos)
#define US_CSR_LIN_TXEMPTY_1        (US_CSR_LIN_TXEMPTY_1_Val      << US_CSR_LIN_TXEMPTY_Pos)
#define US_CSR_LIN_ITER_Pos         10           /**< \brief (US_CSR_LIN) Max number of Repetitions Reached */
#define US_CSR_LIN_ITER             (0x1u << US_CSR_LIN_ITER_Pos)
#define   US_CSR_LIN_ITER_0_Val           0x0u   /**< \brief (US_CSR_LIN) Maximum number of repetitions has not been reached since the last RSIT */
#define   US_CSR_LIN_ITER_1_Val           0x1u   /**< \brief (US_CSR_LIN) Maximum number of repetitions has been reached since the last RSIT */
#define US_CSR_LIN_ITER_0           (US_CSR_LIN_ITER_0_Val         << US_CSR_LIN_ITER_Pos)
#define US_CSR_LIN_ITER_1           (US_CSR_LIN_ITER_1_Val         << US_CSR_LIN_ITER_Pos)
#define US_CSR_LIN_TXBUFE_Pos       11           /**< \brief (US_CSR_LIN) Transmission Buffer Empty */
#define US_CSR_LIN_TXBUFE           (0x1u << US_CSR_LIN_TXBUFE_Pos)
#define   US_CSR_LIN_TXBUFE_0_Val         0x0u   /**< \brief (US_CSR_LIN) The signal Buffer Empty from the Transmit PDC channel is inactive */
#define   US_CSR_LIN_TXBUFE_1_Val         0x1u   /**< \brief (US_CSR_LIN) The signal Buffer Empty from the Transmit PDC channel is active */
#define US_CSR_LIN_TXBUFE_0         (US_CSR_LIN_TXBUFE_0_Val       << US_CSR_LIN_TXBUFE_Pos)
#define US_CSR_LIN_TXBUFE_1         (US_CSR_LIN_TXBUFE_1_Val       << US_CSR_LIN_TXBUFE_Pos)
#define US_CSR_LIN_RXBUFF_Pos       12           /**< \brief (US_CSR_LIN) Reception Buffer Full */
#define US_CSR_LIN_RXBUFF           (0x1u << US_CSR_LIN_RXBUFF_Pos)
#define   US_CSR_LIN_RXBUFF_0_Val         0x0u   /**< \brief (US_CSR_LIN) The signal Buffer Full from the Receive PDC channel is inactive */
#define   US_CSR_LIN_RXBUFF_1_Val         0x1u   /**< \brief (US_CSR_LIN) The signal Buffer Full from the Receive PDC channel is active */
#define US_CSR_LIN_RXBUFF_0         (US_CSR_LIN_RXBUFF_0_Val       << US_CSR_LIN_RXBUFF_Pos)
#define US_CSR_LIN_RXBUFF_1         (US_CSR_LIN_RXBUFF_1_Val       << US_CSR_LIN_RXBUFF_Pos)
#define US_CSR_LIN_NACK_Pos         13           /**< \brief (US_CSR_LIN) Non Acknowledge or LIN Break Sent or LIN Break Received */
#define US_CSR_LIN_NACK             (0x1u << US_CSR_LIN_NACK_Pos)
#define   US_CSR_LIN_NACK_0_Val           0x0u   /**< \brief (US_CSR_LIN) No Non Acknowledge has not been detected since the last RSTNACK */
#define   US_CSR_LIN_NACK_1_Val           0x1u   /**< \brief (US_CSR_LIN) At least one Non Acknowledge has been detected since the last RSTNACK */
#define US_CSR_LIN_NACK_0           (US_CSR_LIN_NACK_0_Val         << US_CSR_LIN_NACK_Pos)
#define US_CSR_LIN_NACK_1           (US_CSR_LIN_NACK_1_Val         << US_CSR_LIN_NACK_Pos)
#define US_CSR_LIN_LINID_Pos        14           /**< \brief (US_CSR_LIN) LIN Identifier Sent or LIN Identifier Received */
#define US_CSR_LIN_LINID            (0x1u << US_CSR_LIN_LINID_Pos)
#define US_CSR_LIN_LINTC_Pos        15           /**< \brief (US_CSR_LIN) LIN Transfer Conpleted */
#define US_CSR_LIN_LINTC            (0x1u << US_CSR_LIN_LINTC_Pos)
#define US_CSR_LIN_RIIC_Pos         16           /**< \brief (US_CSR_LIN) Ring Indicator Input Change Flag */
#define US_CSR_LIN_RIIC             (0x1u << US_CSR_LIN_RIIC_Pos)
#define   US_CSR_LIN_RIIC_0_Val           0x0u   /**< \brief (US_CSR_LIN) No input change has been detected on the RI pin since the last read of CSR */
#define   US_CSR_LIN_RIIC_1_Val           0x1u   /**< \brief (US_CSR_LIN) At least one input change has been detected on the RI pin since the last read of CSR */
#define US_CSR_LIN_RIIC_0           (US_CSR_LIN_RIIC_0_Val         << US_CSR_LIN_RIIC_Pos)
#define US_CSR_LIN_RIIC_1           (US_CSR_LIN_RIIC_1_Val         << US_CSR_LIN_RIIC_Pos)
#define US_CSR_LIN_DSRIC_Pos        17           /**< \brief (US_CSR_LIN) Data Set Ready Input Change Flag */
#define US_CSR_LIN_DSRIC            (0x1u << US_CSR_LIN_DSRIC_Pos)
#define   US_CSR_LIN_DSRIC_0_Val          0x0u   /**< \brief (US_CSR_LIN) No input change has been detected on the DSR pin since the last read of CSR */
#define   US_CSR_LIN_DSRIC_1_Val          0x1u   /**< \brief (US_CSR_LIN) At least one input change has been detected on the DSR pin since the last read of CSR */
#define US_CSR_LIN_DSRIC_0          (US_CSR_LIN_DSRIC_0_Val        << US_CSR_LIN_DSRIC_Pos)
#define US_CSR_LIN_DSRIC_1          (US_CSR_LIN_DSRIC_1_Val        << US_CSR_LIN_DSRIC_Pos)
#define US_CSR_LIN_DCDIC_Pos        18           /**< \brief (US_CSR_LIN) Data Carrier Detect Input Change Flag */
#define US_CSR_LIN_DCDIC            (0x1u << US_CSR_LIN_DCDIC_Pos)
#define   US_CSR_LIN_DCDIC_0_Val          0x0u   /**< \brief (US_CSR_LIN) No input change has been detected on the DCD pin since the last read of CSR */
#define   US_CSR_LIN_DCDIC_1_Val          0x1u   /**< \brief (US_CSR_LIN) At least one input change has been detected on the DCD pin since the last read of CSR */
#define US_CSR_LIN_DCDIC_0          (US_CSR_LIN_DCDIC_0_Val        << US_CSR_LIN_DCDIC_Pos)
#define US_CSR_LIN_DCDIC_1          (US_CSR_LIN_DCDIC_1_Val        << US_CSR_LIN_DCDIC_Pos)
#define US_CSR_LIN_CTSIC_Pos        19           /**< \brief (US_CSR_LIN) Clear to Send Input Change Flag */
#define US_CSR_LIN_CTSIC            (0x1u << US_CSR_LIN_CTSIC_Pos)
#define   US_CSR_LIN_CTSIC_0_Val          0x0u   /**< \brief (US_CSR_LIN) No input change has been detected on the CTS pin since the last read of CSR */
#define   US_CSR_LIN_CTSIC_1_Val          0x1u   /**< \brief (US_CSR_LIN) At least one input change has been detected on the CTS pin since the last read of CSR */
#define US_CSR_LIN_CTSIC_0          (US_CSR_LIN_CTSIC_0_Val        << US_CSR_LIN_CTSIC_Pos)
#define US_CSR_LIN_CTSIC_1          (US_CSR_LIN_CTSIC_1_Val        << US_CSR_LIN_CTSIC_Pos)
#define US_CSR_LIN_RI_Pos           20           /**< \brief (US_CSR_LIN) Image of RI Input */
#define US_CSR_LIN_RI               (0x1u << US_CSR_LIN_RI_Pos)
#define   US_CSR_LIN_RI_0_Val             0x0u   /**< \brief (US_CSR_LIN) RI is at 0 */
#define   US_CSR_LIN_RI_1_Val             0x1u   /**< \brief (US_CSR_LIN) RI is at 1 */
#define US_CSR_LIN_RI_0             (US_CSR_LIN_RI_0_Val           << US_CSR_LIN_RI_Pos)
#define US_CSR_LIN_RI_1             (US_CSR_LIN_RI_1_Val           << US_CSR_LIN_RI_Pos)
#define US_CSR_LIN_DSR_Pos          21           /**< \brief (US_CSR_LIN) Image of DSR Input */
#define US_CSR_LIN_DSR              (0x1u << US_CSR_LIN_DSR_Pos)
#define   US_CSR_LIN_DSR_0_Val            0x0u   /**< \brief (US_CSR_LIN) DSR is at 0 */
#define   US_CSR_LIN_DSR_1_Val            0x1u   /**< \brief (US_CSR_LIN) DSR is at 1 */
#define US_CSR_LIN_DSR_0            (US_CSR_LIN_DSR_0_Val          << US_CSR_LIN_DSR_Pos)
#define US_CSR_LIN_DSR_1            (US_CSR_LIN_DSR_1_Val          << US_CSR_LIN_DSR_Pos)
#define US_CSR_LIN_DCD_Pos          22           /**< \brief (US_CSR_LIN) Image of DCD Input */
#define US_CSR_LIN_DCD              (0x1u << US_CSR_LIN_DCD_Pos)
#define   US_CSR_LIN_DCD_0_Val            0x0u   /**< \brief (US_CSR_LIN) DCD is at 0 */
#define   US_CSR_LIN_DCD_1_Val            0x1u   /**< \brief (US_CSR_LIN) DCD is at 1 */
#define US_CSR_LIN_DCD_0            (US_CSR_LIN_DCD_0_Val          << US_CSR_LIN_DCD_Pos)
#define US_CSR_LIN_DCD_1            (US_CSR_LIN_DCD_1_Val          << US_CSR_LIN_DCD_Pos)
#define US_CSR_LIN_LINBLS_Pos       23           /**< \brief (US_CSR_LIN) LIN Bus Line Status */
#define US_CSR_LIN_LINBLS           (0x1u << US_CSR_LIN_LINBLS_Pos)
#define   US_CSR_LIN_LINBLS_0_Val         0x0u   /**< \brief (US_CSR_LIN) CTS is at 0 */
#define   US_CSR_LIN_LINBLS_1_Val         0x1u   /**< \brief (US_CSR_LIN) CTS is at 1 */
#define US_CSR_LIN_LINBLS_0         (US_CSR_LIN_LINBLS_0_Val       << US_CSR_LIN_LINBLS_Pos)
#define US_CSR_LIN_LINBLS_1         (US_CSR_LIN_LINBLS_1_Val       << US_CSR_LIN_LINBLS_Pos)
#define US_CSR_LIN_LINBE_Pos        25           /**< \brief (US_CSR_LIN) LIN Bit Error */
#define US_CSR_LIN_LINBE            (0x1u << US_CSR_LIN_LINBE_Pos)
#define US_CSR_LIN_LINISFE_Pos      26           /**< \brief (US_CSR_LIN) LIN Inconsistent Synch Field Error */
#define US_CSR_LIN_LINISFE          (0x1u << US_CSR_LIN_LINISFE_Pos)
#define US_CSR_LIN_LINIPE_Pos       27           /**< \brief (US_CSR_LIN) LIN Identifier Parity Error */
#define US_CSR_LIN_LINIPE           (0x1u << US_CSR_LIN_LINIPE_Pos)
#define US_CSR_LIN_LINCE_Pos        28           /**< \brief (US_CSR_LIN) LIN Checksum Error */
#define US_CSR_LIN_LINCE            (0x1u << US_CSR_LIN_LINCE_Pos)
#define US_CSR_LIN_LINSNRE_Pos      29           /**< \brief (US_CSR_LIN) LIN Slave Not Responding Error */
#define US_CSR_LIN_LINSNRE          (0x1u << US_CSR_LIN_LINSNRE_Pos)
#define US_CSR_LIN_LINSTE_Pos       30           /**< \brief (US_CSR_LIN) LIN Synch Tolerance Error */
#define US_CSR_LIN_LINSTE           (0x1u << US_CSR_LIN_LINSTE_Pos)
#define   US_CSR_LIN_LINSTE_0_Val         0x0u   /**< \brief (US_CSR_LIN) COMM_TX is at 0 */
#define   US_CSR_LIN_LINSTE_1_Val         0x1u   /**< \brief (US_CSR_LIN) COMM_TX is at 1 */
#define US_CSR_LIN_LINSTE_0         (US_CSR_LIN_LINSTE_0_Val       << US_CSR_LIN_LINSTE_Pos)
#define US_CSR_LIN_LINSTE_1         (US_CSR_LIN_LINSTE_1_Val       << US_CSR_LIN_LINSTE_Pos)
#define US_CSR_LIN_LINHTE_Pos       31           /**< \brief (US_CSR_LIN) LIN Header Timeout Error */
#define US_CSR_LIN_LINHTE           (0x1u << US_CSR_LIN_LINHTE_Pos)
#define   US_CSR_LIN_LINHTE_0_Val         0x0u   /**< \brief (US_CSR_LIN) COMM_RX is at 0 */
#define   US_CSR_LIN_LINHTE_1_Val         0x1u   /**< \brief (US_CSR_LIN) COMM_RX is at 1 */
#define US_CSR_LIN_LINHTE_0         (US_CSR_LIN_LINHTE_0_Val       << US_CSR_LIN_LINHTE_Pos)
#define US_CSR_LIN_LINHTE_1         (US_CSR_LIN_LINHTE_1_Val       << US_CSR_LIN_LINHTE_Pos)
#define US_CSR_LIN_MASK             0xFEFFFFE7u  /**< \brief (US_CSR_LIN) MASK Register */

