synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/usart.h
// SPI_SLAVE mode
#define US_CSR_SPI_SLAVE_RXRDY_Pos  0            /**< \brief (US_CSR_SPI_SLAVE) Receiver Ready */
#define US_CSR_SPI_SLAVE_RXRDY      (0x1u << US_CSR_SPI_SLAVE_RXRDY_Pos)
#define   US_CSR_SPI_SLAVE_RXRDY_0_Val    0x0u   /**< \brief (US_CSR_SPI_SLAVE) No complete character has been received since the last read of RHR or the receiver is disabled. If characters werebeing received when the receiver was disabled, RXRDY changes to 1 when the receiver is enabled */
#define   US_CSR_SPI_SLAVE_RXRDY_1_Val    0x1u   /**< \brief (US_CSR_SPI_SLAVE) At least one complete character has been received and RHR has not yet been read */
#define US_CSR_SPI_SLAVE_RXRDY_0    (US_CSR_SPI_SLAVE_RXRDY_0_Val  << US_CSR_SPI_SLAVE_RXRDY_Pos)
#define US_CSR_SPI_SLAVE_RXRDY_1    (US_CSR_SPI_SLAVE_RXRDY_1_Val  << US_CSR_SPI_SLAVE_RXRDY_Pos)
#define US_CSR_SPI_SLAVE_TXRDY_Pos  1            /**< \brief (US_CSR_SPI_SLAVE) Transmitter Ready */
#define US_CSR_SPI_SLAVE_TXRDY      (0x1u << US_CSR_SPI_SLAVE_TXRDY_Pos)
#define   US_CSR_SPI_SLAVE_TXRDY_0_Val    0x0u   /**< \brief (US_CSR_SPI_SLAVE) A character is in the THR waiting to be transferred to the Transmit Shift Register, or an STTBRK command has been requested, or the transmitter is disabled. As soon as the transmitter is enabled, TXRDY becomes 1 */
#define   US_CSR_SPI_SLAVE_TXRDY_1_Val    0x1u   /**< \brief (US_CSR_SPI_SLAVE) There is no character in the THR */
#define US_CSR_SPI_SLAVE_TXRDY_0    (US_CSR_SPI_SLAVE_TXRDY_0_Val  << US_CSR_SPI_SLAVE_TXRDY_Pos)
#define US_CSR_SPI_SLAVE_TXRDY_1    (US_CSR_SPI_SLAVE_TXRDY_1_Val  << US_CSR_SPI_SLAVE_TXRDY_Pos)
#define US_CSR_SPI_SLAVE_RXBRK_Pos  2            /**< \brief (US_CSR_SPI_SLAVE) Break Received/End of Break */
#define US_CSR_SPI_SLAVE_RXBRK      (0x1u << US_CSR_SPI_SLAVE_RXBRK_Pos)
#define   US_CSR_SPI_SLAVE_RXBRK_0_Val    0x0u   /**< \brief (US_CSR_SPI_SLAVE) No Break received or End of Break detected since the last RSTSTA */
#define   US_CSR_SPI_SLAVE_RXBRK_1_Val    0x1u   /**< \brief (US_CSR_SPI_SLAVE) Break Received or End of Break detected since the last RSTSTA */
#define US_CSR_SPI_SLAVE_RXBRK_0    (US_CSR_SPI_SLAVE_RXBRK_0_Val  << US_CSR_SPI_SLAVE_RXBRK_Pos)
#define US_CSR_SPI_SLAVE_RXBRK_1    (US_CSR_SPI_SLAVE_RXBRK_1_Val  << US_CSR_SPI_SLAVE_RXBRK_Pos)
#define US_CSR_SPI_SLAVE_OVRE_Pos   5            /**< \brief (US_CSR_SPI_SLAVE) Overrun Error */
#define US_CSR_SPI_SLAVE_OVRE       (0x1u << US_CSR_SPI_SLAVE_OVRE_Pos)
#define   US_CSR_SPI_SLAVE_OVRE_0_Val     0x0u   /**< \brief (US_CSR_SPI_SLAVE) No overrun error has occurred since since the last RSTSTA */
#define   US_CSR_SPI_SLAVE_OVRE_1_Val     0x1u   /**< \brief (US_CSR_SPI_SLAVE) At least one overrun error has occurred since the last RSTSTA */
#define US_CSR_SPI_SLAVE_OVRE_0     (US_CSR_SPI_SLAVE_OVRE_0_Val   << US_CSR_SPI_SLAVE_OVRE_Pos)
#define US_CSR_SPI_SLAVE_OVRE_1     (US_CSR_SPI_SLAVE_OVRE_1_Val   << US_CSR_SPI_SLAVE_OVRE_Pos)
#define US_CSR_SPI_SLAVE_FRAME_Pos  6            /**< \brief (US_CSR_SPI_SLAVE) Framing Error */
#define US_CSR_SPI_SLAVE_FRAME      (0x1u << US_CSR_SPI_SLAVE_FRAME_Pos)
#define   US_CSR_SPI_SLAVE_FRAME_0_Val    0x0u   /**< \brief (US_CSR_SPI_SLAVE) No stop bit has been detected low since the last RSTSTA */
#define   US_CSR_SPI_SLAVE_FRAME_1_Val    0x1u   /**< \brief (US_CSR_SPI_SLAVE) At least one stop bit has been detected low since the last RSTSTA */
#define US_CSR_SPI_SLAVE_FRAME_0    (US_CSR_SPI_SLAVE_FRAME_0_Val  << US_CSR_SPI_SLAVE_FRAME_Pos)
#define US_CSR_SPI_SLAVE_FRAME_1    (US_CSR_SPI_SLAVE_FRAME_1_Val  << US_CSR_SPI_SLAVE_FRAME_Pos)
#define US_CSR_SPI_SLAVE_PARE_Pos   7            /**< \brief (US_CSR_SPI_SLAVE) Parity Error */
#define US_CSR_SPI_SLAVE_PARE       (0x1u << US_CSR_SPI_SLAVE_PARE_Pos)
#define   US_CSR_SPI_SLAVE_PARE_0_Val     0x0u   /**< \brief (US_CSR_SPI_SLAVE) No parity error has been detected since the last RSTSTA */
#define   US_CSR_SPI_SLAVE_PARE_1_Val     0x1u   /**< \brief (US_CSR_SPI_SLAVE) At least one parity error has been detected since the last RSTSTA */
#define US_CSR_SPI_SLAVE_PARE_0     (US_CSR_SPI_SLAVE_PARE_0_Val   << US_CSR_SPI_SLAVE_PARE_Pos)
#define US_CSR_SPI_SLAVE_PARE_1     (US_CSR_SPI_SLAVE_PARE_1_Val   << US_CSR_SPI_SLAVE_PARE_Pos)
#define US_CSR_SPI_SLAVE_TIMEOUT_Pos 8            /**< \brief (US_CSR_SPI_SLAVE) Receiver Time-out */
#define US_CSR_SPI_SLAVE_TIMEOUT    (0x1u << US_CSR_SPI_SLAVE_TIMEOUT_Pos)
#define   US_CSR_SPI_SLAVE_TIMEOUT_0_Val  0x0u   /**< \brief (US_CSR_SPI_SLAVE) There has not been a time-out since the last Start Time-out command or the Time-out Register is 0 */
#define   US_CSR_SPI_SLAVE_TIMEOUT_1_Val  0x1u   /**< \brief (US_CSR_SPI_SLAVE) There has been a time-out since the last Start Time-out command */
#define US_CSR_SPI_SLAVE_TIMEOUT_0  (US_CSR_SPI_SLAVE_TIMEOUT_0_Val << US_CSR_SPI_SLAVE_TIMEOUT_Pos)
#define US_CSR_SPI_SLAVE_TIMEOUT_1  (US_CSR_SPI_SLAVE_TIMEOUT_1_Val << US_CSR_SPI_SLAVE_TIMEOUT_Pos)
#define US_CSR_SPI_SLAVE_TXEMPTY_Pos 9            /**< \brief (US_CSR_SPI_SLAVE) Transmitter Empty */
#define US_CSR_SPI_SLAVE_TXEMPTY    (0x1u << US_CSR_SPI_SLAVE_TXEMPTY_Pos)
#define   US_CSR_SPI_SLAVE_TXEMPTY_0_Val  0x0u   /**< \brief (US_CSR_SPI_SLAVE) There are characters in either THR or the Transmit Shift Register, or the transmitter is disabled */
#define   US_CSR_SPI_SLAVE_TXEMPTY_1_Val  0x1u   /**< \brief (US_CSR_SPI_SLAVE) There is at least one character in either THR or the Transmit Shift Register */
#define US_CSR_SPI_SLAVE_TXEMPTY_0  (US_CSR_SPI_SLAVE_TXEMPTY_0_Val << US_CSR_SPI_SLAVE_TXEMPTY_Pos)
#define US_CSR_SPI_SLAVE_TXEMPTY_1  (US_CSR_SPI_SLAVE_TXEMPTY_1_Val << US_CSR_SPI_SLAVE_TXEMPTY_Pos)
#define US_CSR_SPI_SLAVE_UNRE_Pos   10           /**< \brief (US_CSR_SPI_SLAVE) SPI Underrun Error */
#define US_CSR_SPI_SLAVE_UNRE       (0x1u << US_CSR_SPI_SLAVE_UNRE_Pos)
#define   US_CSR_SPI_SLAVE_UNRE_0_Val     0x0u   /**< \brief (US_CSR_SPI_SLAVE) No SPI underrun error has occurred since the last RSTSTA */
#define   US_CSR_SPI_SLAVE_UNRE_1_Val     0x1u   /**< \brief (US_CSR_SPI_SLAVE) At least one SPI underrun error has occurred since the last RSTSTA */
#define US_CSR_SPI_SLAVE_UNRE_0     (US_CSR_SPI_SLAVE_UNRE_0_Val   << US_CSR_SPI_SLAVE_UNRE_Pos)
#define US_CSR_SPI_SLAVE_UNRE_1     (US_CSR_SPI_SLAVE_UNRE_1_Val   << US_CSR_SPI_SLAVE_UNRE_Pos)
#define US_CSR_SPI_SLAVE_TXBUFE_Pos 11           /**< \brief (US_CSR_SPI_SLAVE) Transmission Buffer Empty */
#define US_CSR_SPI_SLAVE_TXBUFE     (0x1u << US_CSR_SPI_SLAVE_TXBUFE_Pos)
#define   US_CSR_SPI_SLAVE_TXBUFE_0_Val   0x0u   /**< \brief (US_CSR_SPI_SLAVE) The signal Buffer Empty from the Transmit PDC channel is inactive */
#define   US_CSR_SPI_SLAVE_TXBUFE_1_Val   0x1u   /**< \brief (US_CSR_SPI_SLAVE) The signal Buffer Empty from the Transmit PDC channel is active */
#define US_CSR_SPI_SLAVE_TXBUFE_0   (US_CSR_SPI_SLAVE_TXBUFE_0_Val << US_CSR_SPI_SLAVE_TXBUFE_Pos)
#define US_CSR_SPI_SLAVE_TXBUFE_1   (US_CSR_SPI_SLAVE_TXBUFE_1_Val << US_CSR_SPI_SLAVE_TXBUFE_Pos)
#define US_CSR_SPI_SLAVE_RXBUFF_Pos 12           /**< \brief (US_CSR_SPI_SLAVE) Reception Buffer Full */
#define US_CSR_SPI_SLAVE_RXBUFF     (0x1u << US_CSR_SPI_SLAVE_RXBUFF_Pos)
#define   US_CSR_SPI_SLAVE_RXBUFF_0_Val   0x0u   /**< \brief (US_CSR_SPI_SLAVE) The signal Buffer Full from the Receive PDC channel is inactive */
#define   US_CSR_SPI_SLAVE_RXBUFF_1_Val   0x1u   /**< \brief (US_CSR_SPI_SLAVE) The signal Buffer Full from the Receive PDC channel is active */
#define US_CSR_SPI_SLAVE_RXBUFF_0   (US_CSR_SPI_SLAVE_RXBUFF_0_Val << US_CSR_SPI_SLAVE_RXBUFF_Pos)
#define US_CSR_SPI_SLAVE_RXBUFF_1   (US_CSR_SPI_SLAVE_RXBUFF_1_Val << US_CSR_SPI_SLAVE_RXBUFF_Pos)
#define US_CSR_SPI_SLAVE_NACK_Pos   13           /**< \brief (US_CSR_SPI_SLAVE) Non Acknowledge */
#define US_CSR_SPI_SLAVE_NACK       (0x1u << US_CSR_SPI_SLAVE_NACK_Pos)
#define   US_CSR_SPI_SLAVE_NACK_0_Val     0x0u   /**< \brief (US_CSR_SPI_SLAVE) No Non Acknowledge has not been detected since the last RSTNACK */
#define   US_CSR_SPI_SLAVE_NACK_1_Val     0x1u   /**< \brief (US_CSR_SPI_SLAVE) At least one Non Acknowledge has been detected since the last RSTNACK */
#define US_CSR_SPI_SLAVE_NACK_0     (US_CSR_SPI_SLAVE_NACK_0_Val   << US_CSR_SPI_SLAVE_NACK_Pos)
#define US_CSR_SPI_SLAVE_NACK_1     (US_CSR_SPI_SLAVE_NACK_1_Val   << US_CSR_SPI_SLAVE_NACK_Pos)
#define US_CSR_SPI_SLAVE_RIIC_Pos   16           /**< \brief (US_CSR_SPI_SLAVE) Ring Indicator Input Change Flag */
#define US_CSR_SPI_SLAVE_RIIC       (0x1u << US_CSR_SPI_SLAVE_RIIC_Pos)
#define   US_CSR_SPI_SLAVE_RIIC_0_Val     0x0u   /**< \brief (US_CSR_SPI_SLAVE) No input change has been detected on the RI pin since the last read of CSR */
#define   US_CSR_SPI_SLAVE_RIIC_1_Val     0x1u   /**< \brief (US_CSR_SPI_SLAVE) At least one input change has been detected on the RI pin since the last read of CSR */
#define US_CSR_SPI_SLAVE_RIIC_0     (US_CSR_SPI_SLAVE_RIIC_0_Val   << US_CSR_SPI_SLAVE_RIIC_Pos)
#define US_CSR_SPI_SLAVE_RIIC_1     (US_CSR_SPI_SLAVE_RIIC_1_Val   << US_CSR_SPI_SLAVE_RIIC_Pos)
#define US_CSR_SPI_SLAVE_DSRIC_Pos  17           /**< \brief (US_CSR_SPI_SLAVE) Data Set Ready Input Change Flag */
#define US_CSR_SPI_SLAVE_DSRIC      (0x1u << US_CSR_SPI_SLAVE_DSRIC_Pos)
#define   US_CSR_SPI_SLAVE_DSRIC_0_Val    0x0u   /**< \brief (US_CSR_SPI_SLAVE) No input change has been detected on the DSR pin since the last read of CSR */
#define   US_CSR_SPI_SLAVE_DSRIC_1_Val    0x1u   /**< \brief (US_CSR_SPI_SLAVE) At least one input change has been detected on the DSR pin since the last read of CSR */
#define US_CSR_SPI_SLAVE_DSRIC_0    (US_CSR_SPI_SLAVE_DSRIC_0_Val  << US_CSR_SPI_SLAVE_DSRIC_Pos)
#define US_CSR_SPI_SLAVE_DSRIC_1    (US_CSR_SPI_SLAVE_DSRIC_1_Val  << US_CSR_SPI_SLAVE_DSRIC_Pos)
#define US_CSR_SPI_SLAVE_DCDIC_Pos  18           /**< \brief (US_CSR_SPI_SLAVE) Data Carrier Detect Input Change Flag */
#define US_CSR_SPI_SLAVE_DCDIC      (0x1u << US_CSR_SPI_SLAVE_DCDIC_Pos)
#define   US_CSR_SPI_SLAVE_DCDIC_0_Val    0x0u   /**< \brief (US_CSR_SPI_SLAVE) No input change has been detected on the DCD pin since the last read of CSR */
#define   US_CSR_SPI_SLAVE_DCDIC_1_Val    0x1u   /**< \brief (US_CSR_SPI_SLAVE) At least one input change has been detected on the DCD pin since the last read of CSR */
#define US_CSR_SPI_SLAVE_DCDIC_0    (US_CSR_SPI_SLAVE_DCDIC_0_Val  << US_CSR_SPI_SLAVE_DCDIC_Pos)
#define US_CSR_SPI_SLAVE_DCDIC_1    (US_CSR_SPI_SLAVE_DCDIC_1_Val  << US_CSR_SPI_SLAVE_DCDIC_Pos)
#define US_CSR_SPI_SLAVE_CTSIC_Pos  19           /**< \brief (US_CSR_SPI_SLAVE) Clear to Send Input Change Flag */
#define US_CSR_SPI_SLAVE_CTSIC      (0x1u << US_CSR_SPI_SLAVE_CTSIC_Pos)
#define   US_CSR_SPI_SLAVE_CTSIC_0_Val    0x0u   /**< \brief (US_CSR_SPI_SLAVE) No input change has been detected on the CTS pin since the last read of CSR */
#define   US_CSR_SPI_SLAVE_CTSIC_1_Val    0x1u   /**< \brief (US_CSR_SPI_SLAVE) At least one input change has been detected on the CTS pin since the last read of CSR */
#define US_CSR_SPI_SLAVE_CTSIC_0    (US_CSR_SPI_SLAVE_CTSIC_0_Val  << US_CSR_SPI_SLAVE_CTSIC_Pos)
#define US_CSR_SPI_SLAVE_CTSIC_1    (US_CSR_SPI_SLAVE_CTSIC_1_Val  << US_CSR_SPI_SLAVE_CTSIC_Pos)
#define US_CSR_SPI_SLAVE_RI_Pos     20           /**< \brief (US_CSR_SPI_SLAVE) Image of RI Input */
#define US_CSR_SPI_SLAVE_RI         (0x1u << US_CSR_SPI_SLAVE_RI_Pos)
#define   US_CSR_SPI_SLAVE_RI_0_Val       0x0u   /**< \brief (US_CSR_SPI_SLAVE) RI is at 0 */
#define   US_CSR_SPI_SLAVE_RI_1_Val       0x1u   /**< \brief (US_CSR_SPI_SLAVE) RI is at 1 */
#define US_CSR_SPI_SLAVE_RI_0       (US_CSR_SPI_SLAVE_RI_0_Val     << US_CSR_SPI_SLAVE_RI_Pos)
#define US_CSR_SPI_SLAVE_RI_1       (US_CSR_SPI_SLAVE_RI_1_Val     << US_CSR_SPI_SLAVE_RI_Pos)
#define US_CSR_SPI_SLAVE_DSR_Pos    21           /**< \brief (US_CSR_SPI_SLAVE) Image of DSR Input */
#define US_CSR_SPI_SLAVE_DSR        (0x1u << US_CSR_SPI_SLAVE_DSR_Pos)
#define   US_CSR_SPI_SLAVE_DSR_0_Val      0x0u   /**< \brief (US_CSR_SPI_SLAVE) DSR is at 0 */
#define   US_CSR_SPI_SLAVE_DSR_1_Val      0x1u   /**< \brief (US_CSR_SPI_SLAVE) DSR is at 1 */
#define US_CSR_SPI_SLAVE_DSR_0      (US_CSR_SPI_SLAVE_DSR_0_Val    << US_CSR_SPI_SLAVE_DSR_Pos)
#define US_CSR_SPI_SLAVE_DSR_1      (US_CSR_SPI_SLAVE_DSR_1_Val    << US_CSR_SPI_SLAVE_DSR_Pos)
#define US_CSR_SPI_SLAVE_DCD_Pos    22           /**< \brief (US_CSR_SPI_SLAVE) Image of DCD Input */
#define US_CSR_SPI_SLAVE_DCD        (0x1u << US_CSR_SPI_SLAVE_DCD_Pos)
#define   US_CSR_SPI_SLAVE_DCD_0_Val      0x0u   /**< \brief (US_CSR_SPI_SLAVE) DCD is at 0 */
#define   US_CSR_SPI_SLAVE_DCD_1_Val      0x1u   /**< \brief (US_CSR_SPI_SLAVE) DCD is at 1 */
#define US_CSR_SPI_SLAVE_DCD_0      (US_CSR_SPI_SLAVE_DCD_0_Val    << US_CSR_SPI_SLAVE_DCD_Pos)
#define US_CSR_SPI_SLAVE_DCD_1      (US_CSR_SPI_SLAVE_DCD_1_Val    << US_CSR_SPI_SLAVE_DCD_Pos)
#define US_CSR_SPI_SLAVE_CTS_Pos    23           /**< \brief (US_CSR_SPI_SLAVE) Image of CTS Input */
#define US_CSR_SPI_SLAVE_CTS        (0x1u << US_CSR_SPI_SLAVE_CTS_Pos)
#define   US_CSR_SPI_SLAVE_CTS_0_Val      0x0u   /**< \brief (US_CSR_SPI_SLAVE) CTS is at 0 */
#define   US_CSR_SPI_SLAVE_CTS_1_Val      0x1u   /**< \brief (US_CSR_SPI_SLAVE) CTS is at 1 */
#define US_CSR_SPI_SLAVE_CTS_0      (US_CSR_SPI_SLAVE_CTS_0_Val    << US_CSR_SPI_SLAVE_CTS_Pos)
#define US_CSR_SPI_SLAVE_CTS_1      (US_CSR_SPI_SLAVE_CTS_1_Val    << US_CSR_SPI_SLAVE_CTS_Pos)
#define US_CSR_SPI_SLAVE_MASK       0x00FF3FE7u  /**< \brief (US_CSR_SPI_SLAVE) MASK Register */

