synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/usart.h
// Any mode
#define US_CSR_RXRDY_Pos            0            /**< \brief (US_CSR) Receiver Ready */
#define US_CSR_RXRDY                (0x1u << US_CSR_RXRDY_Pos)
#define   US_CSR_RXRDY_0_Val              0x0u   /**< \brief (US_CSR) No complete character has been received since the last read of RHR or the receiver is disabled. If characters werebeing received when the receiver was disabled, RXRDY changes to 1 when the receiver is enabled */
#define   US_CSR_RXRDY_1_Val              0x1u   /**< \brief (US_CSR) At least one complete character has been received and RHR has not yet been read */
#define US_CSR_RXRDY_0              (US_CSR_RXRDY_0_Val            << US_CSR_RXRDY_Pos)
#define US_CSR_RXRDY_1              (US_CSR_RXRDY_1_Val            << US_CSR_RXRDY_Pos)
#define US_CSR_TXRDY_Pos            1            /**< \brief (US_CSR) Transmitter Ready */
#define US_CSR_TXRDY                (0x1u << US_CSR_TXRDY_Pos)
#define   US_CSR_TXRDY_0_Val              0x0u   /**< \brief (US_CSR) A character is in the THR waiting to be transferred to the Transmit Shift Register, or an STTBRK command has been requested, or the transmitter is disabled. As soon as the transmitter is enabled, TXRDY becomes 1 */
#define   US_CSR_TXRDY_1_Val              0x1u   /**< \brief (US_CSR) There is no character in the THR */
#define US_CSR_TXRDY_0              (US_CSR_TXRDY_0_Val            << US_CSR_TXRDY_Pos)
#define US_CSR_TXRDY_1              (US_CSR_TXRDY_1_Val            << US_CSR_TXRDY_Pos)
#define US_CSR_RXBRK_Pos            2            /**< \brief (US_CSR) Break Received/End of Break */
#define US_CSR_RXBRK                (0x1u << US_CSR_RXBRK_Pos)
#define   US_CSR_RXBRK_0_Val              0x0u   /**< \brief (US_CSR) No Break received or End of Break detected since the last RSTSTA */
#define   US_CSR_RXBRK_1_Val              0x1u   /**< \brief (US_CSR) Break Received or End of Break detected since the last RSTSTA */
#define US_CSR_RXBRK_0              (US_CSR_RXBRK_0_Val            << US_CSR_RXBRK_Pos)
#define US_CSR_RXBRK_1              (US_CSR_RXBRK_1_Val            << US_CSR_RXBRK_Pos)
#define US_CSR_OVRE_Pos             5            /**< \brief (US_CSR) Overrun Error */
#define US_CSR_OVRE                 (0x1u << US_CSR_OVRE_Pos)
#define   US_CSR_OVRE_0_Val               0x0u   /**< \brief (US_CSR) No overrun error has occurred since since the last RSTSTA */
#define   US_CSR_OVRE_1_Val               0x1u   /**< \brief (US_CSR) At least one overrun error has occurred since the last RSTSTA */
#define US_CSR_OVRE_0               (US_CSR_OVRE_0_Val             << US_CSR_OVRE_Pos)
#define US_CSR_OVRE_1               (US_CSR_OVRE_1_Val             << US_CSR_OVRE_Pos)
#define US_CSR_FRAME_Pos            6            /**< \brief (US_CSR) Framing Error */
#define US_CSR_FRAME                (0x1u << US_CSR_FRAME_Pos)
#define   US_CSR_FRAME_0_Val              0x0u   /**< \brief (US_CSR) No stop bit has been detected low since the last RSTSTA */
#define   US_CSR_FRAME_1_Val              0x1u   /**< \brief (US_CSR) At least one stop bit has been detected low since the last RSTSTA */
#define US_CSR_FRAME_0              (US_CSR_FRAME_0_Val            << US_CSR_FRAME_Pos)
#define US_CSR_FRAME_1              (US_CSR_FRAME_1_Val            << US_CSR_FRAME_Pos)
#define US_CSR_PARE_Pos             7            /**< \brief (US_CSR) Parity Error */
#define US_CSR_PARE                 (0x1u << US_CSR_PARE_Pos)
#define   US_CSR_PARE_0_Val               0x0u   /**< \brief (US_CSR) No parity error has been detected since the last RSTSTA */
#define   US_CSR_PARE_1_Val               0x1u   /**< \brief (US_CSR) At least one parity error has been detected since the last RSTSTA */
#define US_CSR_PARE_0               (US_CSR_PARE_0_Val             << US_CSR_PARE_Pos)
#define US_CSR_PARE_1               (US_CSR_PARE_1_Val             << US_CSR_PARE_Pos)
#define US_CSR_TIMEOUT_Pos          8            /**< \brief (US_CSR) Receiver Time-out */
#define US_CSR_TIMEOUT              (0x1u << US_CSR_TIMEOUT_Pos)
#define   US_CSR_TIMEOUT_0_Val            0x0u   /**< \brief (US_CSR) There has not been a time-out since the last Start Time-out command or the Time-out Register is 0 */
#define   US_CSR_TIMEOUT_1_Val            0x1u   /**< \brief (US_CSR) There has been a time-out since the last Start Time-out command */
#define US_CSR_TIMEOUT_0            (US_CSR_TIMEOUT_0_Val          << US_CSR_TIMEOUT_Pos)
#define US_CSR_TIMEOUT_1            (US_CSR_TIMEOUT_1_Val          << US_CSR_TIMEOUT_Pos)
#define US_CSR_TXEMPTY_Pos          9            /**< \brief (US_CSR) Transmitter Empty */
#define US_CSR_TXEMPTY              (0x1u << US_CSR_TXEMPTY_Pos)
#define   US_CSR_TXEMPTY_0_Val            0x0u   /**< \brief (US_CSR) There are characters in either THR or the Transmit Shift Register, or the transmitter is disabled */
#define   US_CSR_TXEMPTY_1_Val            0x1u   /**< \brief (US_CSR) There is at least one character in either THR or the Transmit Shift Register */
#define US_CSR_TXEMPTY_0            (US_CSR_TXEMPTY_0_Val          << US_CSR_TXEMPTY_Pos)
#define US_CSR_TXEMPTY_1            (US_CSR_TXEMPTY_1_Val          << US_CSR_TXEMPTY_Pos)
#define US_CSR_ITER_Pos             10           /**< \brief (US_CSR) Max number of Repetitions Reached */
#define US_CSR_ITER                 (0x1u << US_CSR_ITER_Pos)
#define   US_CSR_ITER_0_Val               0x0u   /**< \brief (US_CSR) Maximum number of repetitions has not been reached since the last RSIT */
#define   US_CSR_ITER_1_Val               0x1u   /**< \brief (US_CSR) Maximum number of repetitions has been reached since the last RSIT */
#define US_CSR_ITER_0               (US_CSR_ITER_0_Val             << US_CSR_ITER_Pos)
#define US_CSR_ITER_1               (US_CSR_ITER_1_Val             << US_CSR_ITER_Pos)
#define US_CSR_UNRE_Pos             10           /**< \brief (US_CSR) SPI Underrun Error */
#define US_CSR_UNRE                 (0x1u << US_CSR_UNRE_Pos)
#define   US_CSR_UNRE_0_Val               0x0u   /**< \brief (US_CSR) No SPI underrun error has occurred since the last RSTSTA */
#define   US_CSR_UNRE_1_Val               0x1u   /**< \brief (US_CSR) At least one SPI underrun error has occurred since the last RSTSTA */
#define US_CSR_UNRE_0               (US_CSR_UNRE_0_Val             << US_CSR_UNRE_Pos)
#define US_CSR_UNRE_1               (US_CSR_UNRE_1_Val             << US_CSR_UNRE_Pos)
#define US_CSR_ITER_Pos             10           /**< \brief (US_CSR) Max number of Repetitions Reached */
#define US_CSR_ITER                 (0x1u << US_CSR_ITER_Pos)
#define   US_CSR_ITER_0_Val               0x0u   /**< \brief (US_CSR) Maximum number of repetitions has not been reached since the last RSIT */
#define   US_CSR_ITER_1_Val               0x1u   /**< \brief (US_CSR) Maximum number of repetitions has been reached since the last RSIT */
#define US_CSR_ITER_0               (US_CSR_ITER_0_Val             << US_CSR_ITER_Pos)
#define US_CSR_ITER_1               (US_CSR_ITER_1_Val             << US_CSR_ITER_Pos)
#define US_CSR_TXBUFE_Pos           11           /**< \brief (US_CSR) Transmission Buffer Empty */
#define US_CSR_TXBUFE               (0x1u << US_CSR_TXBUFE_Pos)
#define   US_CSR_TXBUFE_0_Val             0x0u   /**< \brief (US_CSR) The signal Buffer Empty from the Transmit PDC channel is inactive */
#define   US_CSR_TXBUFE_1_Val             0x1u   /**< \brief (US_CSR) The signal Buffer Empty from the Transmit PDC channel is active */
#define US_CSR_TXBUFE_0             (US_CSR_TXBUFE_0_Val           << US_CSR_TXBUFE_Pos)
#define US_CSR_TXBUFE_1             (US_CSR_TXBUFE_1_Val           << US_CSR_TXBUFE_Pos)
#define US_CSR_RXBUFF_Pos           12           /**< \brief (US_CSR) Reception Buffer Full */
#define US_CSR_RXBUFF               (0x1u << US_CSR_RXBUFF_Pos)
#define   US_CSR_RXBUFF_0_Val             0x0u   /**< \brief (US_CSR) The signal Buffer Full from the Receive PDC channel is inactive */
#define   US_CSR_RXBUFF_1_Val             0x1u   /**< \brief (US_CSR) The signal Buffer Full from the Receive PDC channel is active */
#define US_CSR_RXBUFF_0             (US_CSR_RXBUFF_0_Val           << US_CSR_RXBUFF_Pos)
#define US_CSR_RXBUFF_1             (US_CSR_RXBUFF_1_Val           << US_CSR_RXBUFF_Pos)
#define US_CSR_NACK_Pos             13           /**< \brief (US_CSR) Non Acknowledge or LIN Break Sent or LIN Break Received */
#define US_CSR_NACK                 (0x1u << US_CSR_NACK_Pos)
#define   US_CSR_NACK_0_Val               0x0u   /**< \brief (US_CSR) No Non Acknowledge has not been detected since the last RSTNACK */
#define   US_CSR_NACK_1_Val               0x1u   /**< \brief (US_CSR) At least one Non Acknowledge has been detected since the last RSTNACK */
#define US_CSR_NACK_0               (US_CSR_NACK_0_Val             << US_CSR_NACK_Pos)
#define US_CSR_NACK_1               (US_CSR_NACK_1_Val             << US_CSR_NACK_Pos)
#define US_CSR_LINID_Pos            14           /**< \brief (US_CSR) LIN Identifier Sent or LIN Identifier Received */
#define US_CSR_LINID                (0x1u << US_CSR_LINID_Pos)
#define US_CSR_LINTC_Pos            15           /**< \brief (US_CSR) LIN Transfer Conpleted */
#define US_CSR_LINTC                (0x1u << US_CSR_LINTC_Pos)
#define US_CSR_RIIC_Pos             16           /**< \brief (US_CSR) Ring Indicator Input Change Flag */
#define US_CSR_RIIC                 (0x1u << US_CSR_RIIC_Pos)
#define   US_CSR_RIIC_0_Val               0x0u   /**< \brief (US_CSR) No input change has been detected on the RI pin since the last read of CSR */
#define   US_CSR_RIIC_1_Val               0x1u   /**< \brief (US_CSR) At least one input change has been detected on the RI pin since the last read of CSR */
#define US_CSR_RIIC_0               (US_CSR_RIIC_0_Val             << US_CSR_RIIC_Pos)
#define US_CSR_RIIC_1               (US_CSR_RIIC_1_Val             << US_CSR_RIIC_Pos)
#define US_CSR_DSRIC_Pos            17           /**< \brief (US_CSR) Data Set Ready Input Change Flag */
#define US_CSR_DSRIC                (0x1u << US_CSR_DSRIC_Pos)
#define   US_CSR_DSRIC_0_Val              0x0u   /**< \brief (US_CSR) No input change has been detected on the DSR pin since the last read of CSR */
#define   US_CSR_DSRIC_1_Val              0x1u   /**< \brief (US_CSR) At least one input change has been detected on the DSR pin since the last read of CSR */
#define US_CSR_DSRIC_0              (US_CSR_DSRIC_0_Val            << US_CSR_DSRIC_Pos)
#define US_CSR_DSRIC_1              (US_CSR_DSRIC_1_Val            << US_CSR_DSRIC_Pos)
#define US_CSR_DCDIC_Pos            18           /**< \brief (US_CSR) Data Carrier Detect Input Change Flag */
#define US_CSR_DCDIC                (0x1u << US_CSR_DCDIC_Pos)
#define   US_CSR_DCDIC_0_Val              0x0u   /**< \brief (US_CSR) No input change has been detected on the DCD pin since the last read of CSR */
#define   US_CSR_DCDIC_1_Val              0x1u   /**< \brief (US_CSR) At least one input change has been detected on the DCD pin since the last read of CSR */
#define US_CSR_DCDIC_0              (US_CSR_DCDIC_0_Val            << US_CSR_DCDIC_Pos)
#define US_CSR_DCDIC_1              (US_CSR_DCDIC_1_Val            << US_CSR_DCDIC_Pos)
#define US_CSR_CTSIC_Pos            19           /**< \brief (US_CSR) Clear to Send Input Change Flag */
#define US_CSR_CTSIC                (0x1u << US_CSR_CTSIC_Pos)
#define   US_CSR_CTSIC_0_Val              0x0u   /**< \brief (US_CSR) No input change has been detected on the CTS pin since the last read of CSR */
#define   US_CSR_CTSIC_1_Val              0x1u   /**< \brief (US_CSR) At least one input change has been detected on the CTS pin since the last read of CSR */
#define US_CSR_CTSIC_0              (US_CSR_CTSIC_0_Val            << US_CSR_CTSIC_Pos)
#define US_CSR_CTSIC_1              (US_CSR_CTSIC_1_Val            << US_CSR_CTSIC_Pos)
#define US_CSR_RI_Pos               20           /**< \brief (US_CSR) Image of RI Input */
#define US_CSR_RI                   (0x1u << US_CSR_RI_Pos)
#define   US_CSR_RI_0_Val                 0x0u   /**< \brief (US_CSR) RI is at 0 */
#define   US_CSR_RI_1_Val                 0x1u   /**< \brief (US_CSR) RI is at 1 */
#define US_CSR_RI_0                 (US_CSR_RI_0_Val               << US_CSR_RI_Pos)
#define US_CSR_RI_1                 (US_CSR_RI_1_Val               << US_CSR_RI_Pos)
#define US_CSR_DSR_Pos              21           /**< \brief (US_CSR) Image of DSR Input */
#define US_CSR_DSR                  (0x1u << US_CSR_DSR_Pos)
#define   US_CSR_DSR_0_Val                0x0u   /**< \brief (US_CSR) DSR is at 0 */
#define   US_CSR_DSR_1_Val                0x1u   /**< \brief (US_CSR) DSR is at 1 */
#define US_CSR_DSR_0                (US_CSR_DSR_0_Val              << US_CSR_DSR_Pos)
#define US_CSR_DSR_1                (US_CSR_DSR_1_Val              << US_CSR_DSR_Pos)
#define US_CSR_DCD_Pos              22           /**< \brief (US_CSR) Image of DCD Input */
#define US_CSR_DCD                  (0x1u << US_CSR_DCD_Pos)
#define   US_CSR_DCD_0_Val                0x0u   /**< \brief (US_CSR) DCD is at 0 */
#define   US_CSR_DCD_1_Val                0x1u   /**< \brief (US_CSR) DCD is at 1 */
#define US_CSR_DCD_0                (US_CSR_DCD_0_Val              << US_CSR_DCD_Pos)
#define US_CSR_DCD_1                (US_CSR_DCD_1_Val              << US_CSR_DCD_Pos)
#define US_CSR_LINBLS_Pos           23           /**< \brief (US_CSR) LIN Bus Line Status */
#define US_CSR_LINBLS               (0x1u << US_CSR_LINBLS_Pos)
#define   US_CSR_LINBLS_0_Val             0x0u   /**< \brief (US_CSR) CTS is at 0 */
#define   US_CSR_LINBLS_1_Val             0x1u   /**< \brief (US_CSR) CTS is at 1 */
#define US_CSR_LINBLS_0             (US_CSR_LINBLS_0_Val           << US_CSR_LINBLS_Pos)
#define US_CSR_LINBLS_1             (US_CSR_LINBLS_1_Val           << US_CSR_LINBLS_Pos)
#define US_CSR_CTS_Pos              23           /**< \brief (US_CSR) Image of CTS Input */
#define US_CSR_CTS                  (0x1u << US_CSR_CTS_Pos)
#define   US_CSR_CTS_0_Val                0x0u   /**< \brief (US_CSR) CTS is at 0 */
#define   US_CSR_CTS_1_Val                0x1u   /**< \brief (US_CSR) CTS is at 1 */
#define US_CSR_CTS_0                (US_CSR_CTS_0_Val              << US_CSR_CTS_Pos)
#define US_CSR_CTS_1                (US_CSR_CTS_1_Val              << US_CSR_CTS_Pos)
#define US_CSR_MANERR_Pos           24           /**< \brief (US_CSR) Manchester Error */
#define US_CSR_MANERR               (0x1u << US_CSR_MANERR_Pos)
#define   US_CSR_MANERR_0_Val             0x0u   /**< \brief (US_CSR) No Manchester error has been detected since the last RSTSTA */
#define   US_CSR_MANERR_1_Val             0x1u   /**< \brief (US_CSR) At least one Manchester error has been detected since the last RSTSTA */
#define US_CSR_MANERR_0             (US_CSR_MANERR_0_Val           << US_CSR_MANERR_Pos)
#define US_CSR_MANERR_1             (US_CSR_MANERR_1_Val           << US_CSR_MANERR_Pos)
#define US_CSR_LINBE_Pos            25           /**< \brief (US_CSR) LIN Bit Error */
#define US_CSR_LINBE                (0x1u << US_CSR_LINBE_Pos)
#define US_CSR_LINISFE_Pos          26           /**< \brief (US_CSR) LIN Inconsistent Synch Field Error */
#define US_CSR_LINISFE              (0x1u << US_CSR_LINISFE_Pos)
#define US_CSR_LINIPE_Pos           27           /**< \brief (US_CSR) LIN Identifier Parity Error */
#define US_CSR_LINIPE               (0x1u << US_CSR_LINIPE_Pos)
#define US_CSR_LINCE_Pos            28           /**< \brief (US_CSR) LIN Checksum Error */
#define US_CSR_LINCE                (0x1u << US_CSR_LINCE_Pos)
#define US_CSR_LINSNRE_Pos          29           /**< \brief (US_CSR) LIN Slave Not Responding Error */
#define US_CSR_LINSNRE              (0x1u << US_CSR_LINSNRE_Pos)
#define US_CSR_LINSTE_Pos           30           /**< \brief (US_CSR) LIN Synch Tolerance Error */
#define US_CSR_LINSTE               (0x1u << US_CSR_LINSTE_Pos)
#define   US_CSR_LINSTE_0_Val             0x0u   /**< \brief (US_CSR) COMM_TX is at 0 */
#define   US_CSR_LINSTE_1_Val             0x1u   /**< \brief (US_CSR) COMM_TX is at 1 */
#define US_CSR_LINSTE_0             (US_CSR_LINSTE_0_Val           << US_CSR_LINSTE_Pos)
#define US_CSR_LINSTE_1             (US_CSR_LINSTE_1_Val           << US_CSR_LINSTE_Pos)
#define US_CSR_LINHTE_Pos           31           /**< \brief (US_CSR) LIN Header Timeout Error */
#define US_CSR_LINHTE               (0x1u << US_CSR_LINHTE_Pos)
#define   US_CSR_LINHTE_0_Val             0x0u   /**< \brief (US_CSR) COMM_RX is at 0 */
#define   US_CSR_LINHTE_1_Val             0x1u   /**< \brief (US_CSR) COMM_RX is at 1 */
#define US_CSR_LINHTE_0             (US_CSR_LINHTE_0_Val           << US_CSR_LINHTE_Pos)
#define US_CSR_LINHTE_1             (US_CSR_LINHTE_1_Val           << US_CSR_LINHTE_Pos)
#define US_CSR_MASK                 0xFFFFFFE7u  /**< \brief (US_CSR) MASK Register */

/* -------- US_RHR : (USART Offset: 0x18) (R/  32) Receiver Holding Register -------- */
#define US_RHR_OFFSET               0x18         /**< \brief (US_RHR offset) Receiver Holding Register */
#define US_RHR_RESETVALUE           0x00000000   /**< \brief (US_RHR reset_value) Receiver Holding Register */

#define US_RHR_RXCHR_Pos            0            /**< \brief (US_RHR) Received Character */
#define US_RHR_RXCHR_Msk            (0x1FFu << US_RHR_RXCHR_Pos)
#define US_RHR_RXCHR(value)         ((US_RHR_RXCHR_Msk & ((value) << US_RHR_RXCHR_Pos)))
#define US_RHR_RXSYNH_Pos           15           /**< \brief (US_RHR) Received Sync */
#define US_RHR_RXSYNH               (0x1u << US_RHR_RXSYNH_Pos)
#define   US_RHR_RXSYNH_0_Val             0x0u   /**< \brief (US_RHR) Last character received is a Data */
#define   US_RHR_RXSYNH_1_Val             0x1u   /**< \brief (US_RHR) Last character received is a Command */
#define US_RHR_RXSYNH_0             (US_RHR_RXSYNH_0_Val           << US_RHR_RXSYNH_Pos)
#define US_RHR_RXSYNH_1             (US_RHR_RXSYNH_1_Val           << US_RHR_RXSYNH_Pos)
#define US_RHR_MASK                 0x000081FFu  /**< \brief (US_RHR) MASK Register */

