synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/usart.h
/* -------- US_IFR : (USART Offset: 0x4C) (R/W 32) IrDA Filter Register -------- */
#define US_IFR_OFFSET               0x4C         /**< \brief (US_IFR offset) IrDA Filter Register */
#define US_IFR_RESETVALUE           0x00000000   /**< \brief (US_IFR reset_value) IrDA Filter Register */

#define US_IFR_IRDA_FILTER_Pos      0            /**< \brief (US_IFR) Irda filter */
#define US_IFR_IRDA_FILTER_Msk      (0xFFu << US_IFR_IRDA_FILTER_Pos)
#define US_IFR_IRDA_FILTER(value)   ((US_IFR_IRDA_FILTER_Msk & ((value) << US_IFR_IRDA_FILTER_Pos)))
#define US_IFR_MASK                 0x000000FFu  /**< \brief (US_IFR) MASK Register */

/* -------- US_MAN : (USART Offset: 0x50) (R/W 32) Manchester Configuration Register -------- */
#define US_MAN_OFFSET               0x50         /**< \brief (US_MAN offset) Manchester Configuration Register */
#define US_MAN_RESETVALUE           0x30011004   /**< \brief (US_MAN reset_value) Manchester Configuration Register */

#define US_MAN_TX_PL_Pos            0            /**< \brief (US_MAN) Transmitter Preamble Length */
#define US_MAN_TX_PL_Msk            (0xFu << US_MAN_TX_PL_Pos)
#define US_MAN_TX_PL(value)         ((US_MAN_TX_PL_Msk & ((value) << US_MAN_TX_PL_Pos)))
#define   US_MAN_TX_PL_0_Val              0x0u   /**< \brief (US_MAN) The Transmitter Preamble pattern generation is disabled */
#define US_MAN_TX_PL_0              (US_MAN_TX_PL_0_Val            << US_MAN_TX_PL_Pos)
#define US_MAN_TX_PP_Pos            8            /**< \brief (US_MAN) Transmitter Preamble Pattern */
#define US_MAN_TX_PP_Msk            (0x3u << US_MAN_TX_PP_Pos)
#define US_MAN_TX_PP(value)         ((US_MAN_TX_PP_Msk & ((value) << US_MAN_TX_PP_Pos)))
#define   US_MAN_TX_PP_0_Val              0x0u   /**< \brief (US_MAN) ALL_ONE */
#define   US_MAN_TX_PP_1_Val              0x1u   /**< \brief (US_MAN) ALL_ZERO */
#define   US_MAN_TX_PP_2_Val              0x2u   /**< \brief (US_MAN) ZERO_ONE */
#define   US_MAN_TX_PP_3_Val              0x3u   /**< \brief (US_MAN) ONE_ZERO */
#define US_MAN_TX_PP_0              (US_MAN_TX_PP_0_Val            << US_MAN_TX_PP_Pos)
#define US_MAN_TX_PP_1              (US_MAN_TX_PP_1_Val            << US_MAN_TX_PP_Pos)
#define US_MAN_TX_PP_2              (US_MAN_TX_PP_2_Val            << US_MAN_TX_PP_Pos)
#define US_MAN_TX_PP_3              (US_MAN_TX_PP_3_Val            << US_MAN_TX_PP_Pos)
#define US_MAN_TX_MPOL_Pos          12           /**< \brief (US_MAN) Transmitter Manchester Polarity */
#define US_MAN_TX_MPOL              (0x1u << US_MAN_TX_MPOL_Pos)
#define   US_MAN_TX_MPOL_0_Val            0x0u   /**< \brief (US_MAN) Logic Zero is coded as a zero-to-one transition, Logic One is coded as a one-to-zero transition */
#define   US_MAN_TX_MPOL_1_Val            0x1u   /**< \brief (US_MAN) Logic Zero is coded as a one-to-zero transition, Logic One is coded as a zero-to-one transition */
#define US_MAN_TX_MPOL_0            (US_MAN_TX_MPOL_0_Val          << US_MAN_TX_MPOL_Pos)
#define US_MAN_TX_MPOL_1            (US_MAN_TX_MPOL_1_Val          << US_MAN_TX_MPOL_Pos)
#define US_MAN_RX_PL_Pos            16           /**< \brief (US_MAN) Receiver Preamble Length */
#define US_MAN_RX_PL_Msk            (0xFu << US_MAN_RX_PL_Pos)
#define US_MAN_RX_PL(value)         ((US_MAN_RX_PL_Msk & ((value) << US_MAN_RX_PL_Pos)))
#define   US_MAN_RX_PL_0_Val              0x0u   /**< \brief (US_MAN) The receiver preamble pattern detection is disabled */
#define US_MAN_RX_PL_0              (US_MAN_RX_PL_0_Val            << US_MAN_RX_PL_Pos)
#define US_MAN_RX_PP_Pos            24           /**< \brief (US_MAN) Receiver Preamble Pattern detected */
#define US_MAN_RX_PP_Msk            (0x3u << US_MAN_RX_PP_Pos)
#define US_MAN_RX_PP(value)         ((US_MAN_RX_PP_Msk & ((value) << US_MAN_RX_PP_Pos)))
#define   US_MAN_RX_PP_0_Val              0x0u   /**< \brief (US_MAN) ALL_ONE */
#define   US_MAN_RX_PP_1_Val              0x1u   /**< \brief (US_MAN) ALL_ZERO */
#define   US_MAN_RX_PP_2_Val              0x2u   /**< \brief (US_MAN) ZERO_ONE */
#define   US_MAN_RX_PP_3_Val              0x3u   /**< \brief (US_MAN) ONE_ZERO */
#define US_MAN_RX_PP_0              (US_MAN_RX_PP_0_Val            << US_MAN_RX_PP_Pos)
#define US_MAN_RX_PP_1              (US_MAN_RX_PP_1_Val            << US_MAN_RX_PP_Pos)
#define US_MAN_RX_PP_2              (US_MAN_RX_PP_2_Val            << US_MAN_RX_PP_Pos)
#define US_MAN_RX_PP_3              (US_MAN_RX_PP_3_Val            << US_MAN_RX_PP_Pos)
#define US_MAN_RX_MPOL_Pos          28           /**< \brief (US_MAN) Receiver Manchester Polarity */
#define US_MAN_RX_MPOL              (0x1u << US_MAN_RX_MPOL_Pos)
#define   US_MAN_RX_MPOL_0_Val            0x0u   /**< \brief (US_MAN) Logic Zero is coded as a zero-to-one transition, Logic One is coded as a one-to-zero transition */
#define   US_MAN_RX_MPOL_1_Val            0x1u   /**< \brief (US_MAN) Logic Zero is coded as a one-to-zero transition, Logic One is coded as a zero-to-one transition */
#define US_MAN_RX_MPOL_0            (US_MAN_RX_MPOL_0_Val          << US_MAN_RX_MPOL_Pos)
#define US_MAN_RX_MPOL_1            (US_MAN_RX_MPOL_1_Val          << US_MAN_RX_MPOL_Pos)
#define US_MAN_DRIFT_Pos            30           /**< \brief (US_MAN) Drift compensation */
#define US_MAN_DRIFT                (0x1u << US_MAN_DRIFT_Pos)
#define   US_MAN_DRIFT_0_Val              0x0u   /**< \brief (US_MAN) The USART can not recover from an important clock drift */
#define   US_MAN_DRIFT_1_Val              0x1u   /**< \brief (US_MAN) The USART can recover from clock drift. The 16X clock mode must be enabled */
#define US_MAN_DRIFT_0              (US_MAN_DRIFT_0_Val            << US_MAN_DRIFT_Pos)
#define US_MAN_DRIFT_1              (US_MAN_DRIFT_1_Val            << US_MAN_DRIFT_Pos)
#define US_MAN_MASK                 0x530F130Fu  /**< \brief (US_MAN) MASK Register */

/* -------- US_LINMR : (USART Offset: 0x54) (R/W 32) LIN Mode Register -------- */
#define US_LINMR_OFFSET             0x54         /**< \brief (US_LINMR offset) LIN Mode Register */
#define US_LINMR_RESETVALUE         0x00000000   /**< \brief (US_LINMR reset_value) LIN Mode Register */

