synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/usart.h
#define US_LINMR_NACT_Pos           0            /**< \brief (US_LINMR) LIN Node Action */
#define US_LINMR_NACT_Msk           (0x3u << US_LINMR_NACT_Pos)
#define US_LINMR_NACT(value)        ((US_LINMR_NACT_Msk & ((value) << US_LINMR_NACT_Pos)))
#define   US_LINMR_NACT_PUBLISH_Val       0x0u   /**< \brief (US_LINMR) The LIN Controller transmits the response */
#define   US_LINMR_NACT_SUBSCRIBE_Val     0x1u   /**< \brief (US_LINMR) The LIN Controller receives the response */
#define   US_LINMR_NACT_IGNORE_Val        0x2u   /**< \brief (US_LINMR) The LIN Controller doesn't transmit and doesn't receive the response */
#define US_LINMR_NACT_PUBLISH       (US_LINMR_NACT_PUBLISH_Val     << US_LINMR_NACT_Pos)
#define US_LINMR_NACT_SUBSCRIBE     (US_LINMR_NACT_SUBSCRIBE_Val   << US_LINMR_NACT_Pos)
#define US_LINMR_NACT_IGNORE        (US_LINMR_NACT_IGNORE_Val      << US_LINMR_NACT_Pos)
#define US_LINMR_PARDIS_Pos         2            /**< \brief (US_LINMR) Parity Disable */
#define US_LINMR_PARDIS             (0x1u << US_LINMR_PARDIS_Pos)
#define US_LINMR_CHKDIS_Pos         3            /**< \brief (US_LINMR) Checksum Disable */
#define US_LINMR_CHKDIS             (0x1u << US_LINMR_CHKDIS_Pos)
#define US_LINMR_CHKTYP_Pos         4            /**< \brief (US_LINMR) Checksum Type */
#define US_LINMR_CHKTYP             (0x1u << US_LINMR_CHKTYP_Pos)
#define US_LINMR_DLM_Pos            5            /**< \brief (US_LINMR) Data Length Mode */
#define US_LINMR_DLM                (0x1u << US_LINMR_DLM_Pos)
#define US_LINMR_FSDIS_Pos          6            /**< \brief (US_LINMR) Frame Slot Mode Disable */
#define US_LINMR_FSDIS              (0x1u << US_LINMR_FSDIS_Pos)
#define US_LINMR_WKUPTYP_Pos        7            /**< \brief (US_LINMR) Wakeup Signal Type */
#define US_LINMR_WKUPTYP            (0x1u << US_LINMR_WKUPTYP_Pos)
#define US_LINMR_DLC_Pos            8            /**< \brief (US_LINMR) Data Length Control */
#define US_LINMR_DLC_Msk            (0xFFu << US_LINMR_DLC_Pos)
#define US_LINMR_DLC(value)         ((US_LINMR_DLC_Msk & ((value) << US_LINMR_DLC_Pos)))
#define US_LINMR_PDCM_Pos           16           /**< \brief (US_LINMR) PDC Mode */
#define US_LINMR_PDCM               (0x1u << US_LINMR_PDCM_Pos)
#define US_LINMR_SYNCDIS_Pos        17           /**< \brief (US_LINMR) Synchronization Disable */
#define US_LINMR_SYNCDIS            (0x1u << US_LINMR_SYNCDIS_Pos)
#define US_LINMR_MASK               0x0003FFFFu  /**< \brief (US_LINMR) MASK Register */

/* -------- US_LINIR : (USART Offset: 0x58) (R/W 32) LIN Identifier Register -------- */
#define US_LINIR_OFFSET             0x58         /**< \brief (US_LINIR offset) LIN Identifier Register */
#define US_LINIR_RESETVALUE         0x00000000   /**< \brief (US_LINIR reset_value) LIN Identifier Register */

#define US_LINIR_IDCHR_Pos          0            /**< \brief (US_LINIR) Identifier Character */
#define US_LINIR_IDCHR_Msk          (0xFFu << US_LINIR_IDCHR_Pos)
#define US_LINIR_IDCHR(value)       ((US_LINIR_IDCHR_Msk & ((value) << US_LINIR_IDCHR_Pos)))
#define US_LINIR_MASK               0x000000FFu  /**< \brief (US_LINIR) MASK Register */

/* -------- US_LINBRR : (USART Offset: 0x5C) (R/  32) LIN Baud Rate Register -------- */
#define US_LINBRR_OFFSET            0x5C         /**< \brief (US_LINBRR offset) LIN Baud Rate Register */
#define US_LINBRR_RESETVALUE        0x00000000   /**< \brief (US_LINBRR reset_value) LIN Baud Rate Register */

#define US_LINBRR_LINCD_Pos         0            /**< \brief (US_LINBRR) Clock Divider after Synchronization */
#define US_LINBRR_LINCD_Msk         (0xFFFFu << US_LINBRR_LINCD_Pos)
#define US_LINBRR_LINCD(value)      ((US_LINBRR_LINCD_Msk & ((value) << US_LINBRR_LINCD_Pos)))
#define US_LINBRR_LINFP_Pos         16           /**< \brief (US_LINBRR) Fractional Part after Synchronization */
#define US_LINBRR_LINFP_Msk         (0x7u << US_LINBRR_LINFP_Pos)
#define US_LINBRR_LINFP(value)      ((US_LINBRR_LINFP_Msk & ((value) << US_LINBRR_LINFP_Pos)))
#define US_LINBRR_MASK              0x0007FFFFu  /**< \brief (US_LINBRR) MASK Register */

/* -------- US_WPMR : (USART Offset: 0xE4) (R/W 32) Write Protect Mode Register -------- */
#define US_WPMR_OFFSET              0xE4         /**< \brief (US_WPMR offset) Write Protect Mode Register */
#define US_WPMR_RESETVALUE          0x00000000   /**< \brief (US_WPMR reset_value) Write Protect Mode Register */

#define US_WPMR_WPEN_Pos            0            /**< \brief (US_WPMR) Write Protect Enable */
#define US_WPMR_WPEN                (0x1u << US_WPMR_WPEN_Pos)
#define   US_WPMR_WPEN_0_Val              0x0u   /**< \brief (US_WPMR) Disables the Write Protect if WPKEY corresponds to 0x858365 ("USA" in ACII) */
#define   US_WPMR_WPEN_1_Val              0x1u   /**< \brief (US_WPMR) Enables the Write Protect if WPKEY corresponds to 0x858365 ("USA" in ACII) */
#define US_WPMR_WPEN_0              (US_WPMR_WPEN_0_Val            << US_WPMR_WPEN_Pos)
#define US_WPMR_WPEN_1              (US_WPMR_WPEN_1_Val            << US_WPMR_WPEN_Pos)
#define US_WPMR_WPKEY_Pos           8            /**< \brief (US_WPMR) Write Protect Key */
#define US_WPMR_WPKEY_Msk           (0xFFFFFFu << US_WPMR_WPKEY_Pos)
#define US_WPMR_WPKEY(value)        ((US_WPMR_WPKEY_Msk & ((value) << US_WPMR_WPKEY_Pos)))
#define US_WPMR_MASK                0xFFFFFF01u  /**< \brief (US_WPMR) MASK Register */

/* -------- US_WPSR : (USART Offset: 0xE8) (R/  32) Write Protect Status Register -------- */
#define US_WPSR_OFFSET              0xE8         /**< \brief (US_WPSR offset) Write Protect Status Register */
#define US_WPSR_RESETVALUE          0x00000000   /**< \brief (US_WPSR reset_value) Write Protect Status Register */

#define US_WPSR_WPV_Pos             0            /**< \brief (US_WPSR) Write Protect Violation Status */
#define US_WPSR_WPV                 (0x1u << US_WPSR_WPV_Pos)
#define   US_WPSR_WPV_0_Val               0x0u   /**< \brief (US_WPSR) No Write Protect Violation has occurred since the last read of the WPSR register */
#define   US_WPSR_WPV_1_Val               0x1u   /**< \brief (US_WPSR) A Write Protect Violation has occurred since the last read of the WPSR register. If this violation is an unauthorized attempt to write a protected register, the associated violation is reported into field WPVSRC */
#define US_WPSR_WPV_0               (US_WPSR_WPV_0_Val             << US_WPSR_WPV_Pos)
#define US_WPSR_WPV_1               (US_WPSR_WPV_1_Val             << US_WPSR_WPV_Pos)
#define US_WPSR_WPVSRC_Pos          8            /**< \brief (US_WPSR) Write Protect Violation Source */
#define US_WPSR_WPVSRC_Msk          (0xFFFFu << US_WPSR_WPVSRC_Pos)
#define US_WPSR_WPVSRC(value)       ((US_WPSR_WPVSRC_Msk & ((value) << US_WPSR_WPVSRC_Pos)))
#define US_WPSR_MASK                0x00FFFF01u  /**< \brief (US_WPSR) MASK Register */

